{
    "descriptions": {
        "AG 200": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 4 units, with a maximum of 2 units per quarter.  Credit can only be used to satisfy free electives.  Credit/No Credit grading only.",
            "title": "Special Problems for Undergraduates"
        },
        "AG 210": {
            "description": "Participation in activities that promote personal growth and leadership development, including team work, cooperation, communication, problem solving, time management, and organization. Support CAFES in recruitment, public awareness, educational programs, campus tours, fundraising, and youth career development events. The Class Schedule will list topic selected. Total credit limited to 2 units. 1 activity.",
            "title": "Agricultural Leadership Experience"
        },
        "AG 212": {
            "description": "Application of the management and operations of the Poly Royal Rodeo event taking place during Open House at Cal Poly. Principles and procedures in planning, organizing, financing, promoting, and managing a major collegiate rodeo and the rodeo industry are discussed. 1 lecture, 2 activities.",
            "title": "Leadership Practice: Poly Royal Rodeo"
        },
        "AG 243": {
            "description": "Beginning through advanced skills in the event areas of college rodeo.  Areas include saddle bronc, bareback, and bull riding; calf, team, and breakaway roping; steer wrestling, goat tying, and barrel racing.  Minimum of 10 hours of laboratory per week.  Total credit limited to 8 units.  Credit/No Credit grading.  Enrollment limited to those qualified to compete in intercollegiate rodeo.",
            "title": "Theory and Practice of Rodeo"
        },
        "AG 254": {
            "description": "Orientation to leadership development in agriculture and related settings. Principles and techniques for developing leadership skills, including exploration of personal characteristics, technical skills, interpersonal influence, commitment, goals, and power necessary for effective leaders. Issues facing leaders in agriculture. 2 lectures.",
            "title": "Introduction to Agricultural Leadership"
        },
        "AG 315": {
            "description": "Origins, application, regulation and technology of organic crop production.  Theoretical and practical issues surrounding organic crop production from a cross-disciplinary perspective.  Topics include the history of the organic movement; current regulation and certification; and field management practices and technologies.  Features industry guest lecturers.  3 lectures, 1 activity.  Crosslisted as AEPS/AG 315.  Fulfills GE Area F.",
            "title": "Organic Crop Production"
        },
        "AG 330": {
            "description": "Scientific investigation of the natural features of the Cal Poly landscape and their transformations by land management technology.  Analysis of the environmental, economic, social, and political effects of agriculture, resource extraction, and construction technology on that landscape.  Emphasis on the educational, land-use, and long term planning issues of technology presented by this case study.  4 lectures.  Crosslisted as AG/ISLA/UNIV 330.  Fulfills GE Area F.",
            "title": "Cal Poly Land: Nature, Technology, and Society"
        },
        "AG 339": {
            "description": "Selected students will spend up to 12 weeks with an approved agricultural firm engaged in production or related business.  Time will be spent applying and developing production and managerial skills and abilities.  One unit of credit may be allowed for each full week of completed and reported internship.  Credit/No Credit grading.",
            "title": "Internship in Agriculture"
        },
        "AG 350": {
            "description": "Interdisciplinary investigation of how human activities impact the Earth's environment on a global scale.  Examination of population, resource use, climate change, and biodiversity from scientific/technical and social/economic/ historical/political perspectives.  Use of remote sensing maps.  Sustainable solutions.  4 lectures.  Crosslisted as AG/EDES/ENGR/GEOG/ISLA/SCM/UNIV 350.  Fulfills GE Area F.",
            "title": "The Global Environment"
        },
        "AG 360": {
            "description": "Application of holistic management, a goal-oriented, value-driven framework for making decisions that are ecologically, economically, and socially sound.  Impact of technology and other tools on ecosystem processes.  Holistic approach to management, especially of land-based resources, aimed toward greater biodiversity and sustainability.  Not open to students with credit in AG 450.  3 lectures, 1 laboratory.  Crosslisted as AG/ASCI 360.  Fulfills GE Area F.",
            "title": "Holistic Management"
        },
        "AG 400": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 4 units, with a maximum of 2 units per quarter.  Credit/No Credit grading only.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "AG 410": {
            "description": "Activities that promote personal growth and development from a leadership perspective.  Special attention on recruiting, organizing, and engaging volunteers.  Teambuilding, cooperation, communication, problem solving, time management, and organization skills are emphasized.  Guiding students in serving others in major student activities.  The Class Schedule will list topic selected.  Total credit limited to 2 units.  1 activity.",
            "title": "Advanced Agricultural Leadership Experience"
        },
        "AG 412": {
            "description": "Management and oversight of AG 212 and Poly Royal Rodeo.  Emphasis on becoming proficient in working as leaders and as a team with a focus on problem-solving.  Annual evaluation of events and planning for the following year's event while successfully mentoring new students.  1 lecture, 2 activities.",
            "title": "Advanced Leadership Practice: Poly Royal Rodeo"
        },
        "AG 413": {
            "description": "Continued management of the Poly Royal Rodeo during Open House.  Oversight of volunteers and committee members as well as interacting with attendees of the event.  Emphasis on leadership and problem solving while working toward building a new management team.  1 lecture, 1 activity.",
            "title": "Committee Management: Poly Royal Rodeo"
        },
        "AG 450": {
            "description": "Application of holistic management, a goal-oriented, value-driven framework for making decisions that are ecologically, economically, and socially sound.  Impact of technology and other tools on ecosystem processes.  Holistic approach to management, especially of land-based resources, aimed toward greater biodiversity and sustainability.  Not open to students with credit in AG/ASCI 360.  3 lectures, 1 laboratory.",
            "title": "Applied Holistic Management"
        },
        "AG 452": {
            "description": "Interactive seminars with speakers from government and industry covering policy and regulations affecting California agriculture.  Students develop an understanding of agricultural policy and work in teams to develop a public presentation and position paper on a significant issue.  Field trip to Sacramento required.  4 seminars.",
            "title": "Issues Affecting California Agriculture"
        },
        "AG 454": {
            "description": "Culminating leadership experience.  Appraise strengths and areas of personal growth, analyze effective strategies in leading others, examine collegiate experiences, and construct a leadership philosophy integrating the research-based leadership theory, skills and traits explored.  1 lecture, 1 activity.",
            "title": "Agricultural Leadership Capstone"
        },
        "AG 485": {
            "description": "Part-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  Formal report and evaluation by work supervisor required.  No major credit allowed; total credit limited to 12 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "AG 495": {
            "description": "Full-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  Formal report and evaluation by work supervisor required.  No major credit allowed; total credit limited to 24 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "AG 500": {
            "description": "Advanced independent study planned and completed under the direction of a member of the college faculty.  Total credit limited to 6 units.",
            "title": "Individual Study"
        },
        "AG 539": {
            "description": "Application of theory to the solution of problems of agricultural production or related businesses in the field.  Analyze specific management problems and perform general management assignments detailed in a contract between the student, the firm or organization, and the faculty advisor before the internship commences.  Degree credit limited to 6 units.",
            "title": "Graduate Internship in Agriculture"
        },
        "AG 581": {
            "description": "Advanced topics in agriculture and natural resources.  Group study of current research and industry trends.  Invited speakers covering a variety of topics.  Total credit limited to 3 units.  1 hour seminar.",
            "title": "Graduate Seminar"
        },
        "AG 585": {
            "description": "Advanced study analysis and part-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  Total credit limited to 9 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "AG 595": {
            "description": "Advanced study analysis and full-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  Total credit limited to 9 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "AG 598": {
            "description": "Systematic development of an agricultural thesis research project including literature searches, reports and experimental design.  Repeatable for up to 12 units.  Credit/No Credit grading only.",
            "title": "Reading and Conference"
        },
        "AG 599": {
            "description": "Systematic research of a significant problem.  Thesis will include problem identification, significance, methods, data analysis, and conclusion.  Students must enroll every quarter in which facilities are used or advisement is received.  Degree credit limited to 6 units.",
            "title": "Thesis"
        }
    },
    "links": [
        {
            "source": "AG 210",
            "target": "AG 410",
            "value": 1
        },
        {
            "source": "AG 212",
            "target": "AG 412",
            "value": 1
        },
        {
            "source": "AG 412",
            "target": "AG 413",
            "value": 1
        },
        {
            "source": "AGED 404",
            "target": "AG 454",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "AG 200"
        },
        {
            "group": 1,
            "id": "AG 210"
        },
        {
            "group": 1,
            "id": "AG 212"
        },
        {
            "group": 1,
            "id": "AG 243"
        },
        {
            "group": 1,
            "id": "AG 254"
        },
        {
            "group": 1,
            "id": "AG 315"
        },
        {
            "group": 1,
            "id": "AG 330"
        },
        {
            "group": 1,
            "id": "AG 339"
        },
        {
            "group": 1,
            "id": "AG 350"
        },
        {
            "group": 1,
            "id": "AG 360"
        },
        {
            "group": 1,
            "id": "AG 400"
        },
        {
            "group": 1,
            "id": "AG 410"
        },
        {
            "group": 1,
            "id": "AG 412"
        },
        {
            "group": 1,
            "id": "AG 413"
        },
        {
            "group": 1,
            "id": "AG 450"
        },
        {
            "group": 1,
            "id": "AG 452"
        },
        {
            "group": 1,
            "id": "AG 454"
        },
        {
            "group": 1,
            "id": "AG 485"
        },
        {
            "group": 1,
            "id": "AG 495"
        },
        {
            "group": 1,
            "id": "AG 500"
        },
        {
            "group": 1,
            "id": "AG 539"
        },
        {
            "group": 1,
            "id": "AG 581"
        },
        {
            "group": 1,
            "id": "AG 585"
        },
        {
            "group": 1,
            "id": "AG 595"
        },
        {
            "group": 1,
            "id": "AG 598"
        },
        {
            "group": 1,
            "id": "AG 599"
        },
        {
            "group": 2,
            "id": "AGED 404"
        }
    ]
}