{
    "descriptions": {
        "ENGR 101": {
            "description": "Strategies for success as an engineering student, including development of intrinsic motivation, time management, self-advocacy, campus resources, and career preparation. Engineering design process, teamwork, and communication skills. Credit/No Credit grading only. 1 activity.",
            "title": "Engineering Student Success"
        },
        "ENGR 110": {
            "description": "Introduction to engineering and the computing disciplines with emphasis on the design process, professionalism, communication, teamwork, diversity and skills for academic success in engineering. 2 lectures.",
            "title": "Introduction to Engineering"
        },
        "ENGR 234": {
            "description": "Introduction to the process of design thinking and human centered design, including design process, methodology, and implementation.  Empathy, creativity, iterative prototyping, and contextual design of products and services.  4 lectures.",
            "title": "Introduction to Design Thinking"
        },
        "ENGR 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "ENGR 301": {
            "description": "Strategies for success as an engineering professional.  Preparation for job searches, including networking and building a professional identity.  Exploration of engineering within context of society and community.  Intended for First Generation and new transfer students.  Credit/ No Credit grading only.  1 activity.",
            "title": "Engineering Professional Success"
        },
        "ENGR 302": {
            "description": "Role of transportation and manufacturing technology in the twenty-first century.  Effects of technological change upon society, and the principles associated with the advancement of transportation and manufacturing technologies in the automotive industry and the industrial-military complex.  Case studies of systems to compare alternative approaches to problem solving.  4 lectures.  Fulfills GE Area F.",
            "title": "Transportation and Manufacturing in the Twenty-First Century"
        },
        "ENGR 310": {
            "description": "Role and impact of entrepreneurship and technology startups; characteristics and traits of entrepreneurs; opportunity identification and assessment; frameworks for building startups; the founding team; organizational and legal issues; business and value proposition models; acquiring resources; entrepreneurial risk; realizing and harvesting value.  4 lectures.  Crosslisted as BUS/ENGR 310.",
            "title": "Introduction to Entrepreneurship"
        },
        "ENGR 322": {
            "description": "Early teaching experience in an informal science, technology, engineering, and mathematics (STEM) teaching and learning environment.  Principles of inquiry-driven STEM education, lesson design, implementation and assessment.  Intended for undergraduates exploring STEM teaching as a career.  Total credit limited to 4 units.  Credit/No Credit grading only.  1 seminar, 1 laboratory.  Crosslisted as ENGR 322/SCM 302/HNRS 302.",
            "title": "The Learn By Doing Lab Teaching Practicum"
        },
        "ENGR 334": {
            "description": "Identification and characterization of human needs for future products, systems, services, and environments.  Observation and interview techniques based on ethnographic approaches and building design empathy.  Emphasis on development of broad and flexible thinking skills for designers to address the needs of a changing society.  Field trips required.  4 lectures.",
            "title": "Needfinding in New Product Design"
        },
        "ENGR 350": {
            "description": "Interdisciplinary investigation of how human activities impact the Earth's environment on a global scale.  Examination of population, resource use, climate change, and biodiversity from scientific/technical and social/economic/ historical/political perspectives.  Use of remote sensing maps.  Sustainable solutions.  4 lectures.  Crosslisted as AG/EDES/ENGR/GEOG/ISLA/SCM/UNIV 350.  Fulfills GE Area F.",
            "title": "The Global Environment"
        },
        "ENGR 400": {
            "description": "Individual investigation, research, studies or surveys of selected problems.  Total credit limited to 4 units.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "ENGR 440": {
            "description": "Preparation for the transition from academia to industry.  Working knowledge of key topics such as leadership, organizational structure, intellectual property, business models, and product development cycles, along with an appreciation of impact of technology on society.  3 lectures.",
            "title": "Engineering as a Profession"
        },
        "ENGR 451": {
            "description": "Current topics in bioengineering, including medical applications and industrial applications.  Total credit limited to 16 units, with a maximum of 4 units per quarter.  See The Schedule of Classes for topic selected.  4 lectures.",
            "title": "Special Topics in Bioengineering"
        },
        "ENGR 459": {
            "description": "First of three courses taken sequentially in a team based interdisciplinary senior design project.  Development of sponsor's needs and generation of design solutions.  Project management, cost analysis, intellectual property, test plans, impact analysis on society, and ethical considerations.  Communication of results to project sponsor.  2 laboratories.",
            "title": "Interdisciplinary Senior Design Project I"
        },
        "ENGR 460": {
            "description": "Continuation of ENGR 459 and senior project.  Activities focus on detail design, analysis and material procurement.  2 laboratories.",
            "title": "Interdisciplinary Senior Design Project II"
        },
        "ENGR 461": {
            "description": "Continuation of ENGR 460 and completion of senior project.  Design verified through prototyping and testing.  2 laboratories.",
            "title": "Interdisciplinary Senior Design Project III"
        },
        "ENGR 462": {
            "description": "Selection and completion of project under faculty supervision.  Projects typical of problems which graduates must solve in their fields of employment.  Project results presented in a formal report.  Minimum commitment of 150 hours.",
            "title": "Senior Project"
        },
        "ENGR 463": {
            "description": "First of three courses taken sequentially in a team based interdisciplinary senior design project with engineering and business students.  Entrepreneurial process through design of a product or service, using customer development and agile engineering.  2 laboratories.",
            "title": "Interdisciplinary Entrepreneurial Senior Design Project I"
        },
        "ENGR 464": {
            "description": "Continuation of ENGR 463 and a team based interdisciplinary senior design project with engineering and business students.  2 laboratories.",
            "title": "Interdisciplinary Entrepreneurial Senior Design Project II"
        },
        "ENGR 465": {
            "description": "Continuation of ENGR 464 and a team based interdisciplinary senior design project with engineering and business students.  2 laboratories.",
            "title": "Interdisciplinary Entrepreneurial Senior Design Project III"
        },
        "ENGR 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1-4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "ENGR 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "ENGR 481": {
            "description": "Selection, development, and completion of project by individuals or team which is typical of problems graduates must solve in their fields of employment or applied research.  Project may involve, but is not limited to, physical modeling and testing of integrated design projects, costs, planning scheduling and research and may involve students from several disciplines.  Formulation of outline, literature review, and project schedule.  2 laboratories.",
            "title": "Senior Project Design Laboratory I"
        },
        "ENGR 482": {
            "description": "Selection, development, and completion of project by individuals or team which is typical of problems graduates must solve in their fields of employment or applied research.  Project may involve, but is not limited to, physical modeling and testing of integrated design projects, costs, planning scheduling and research and may involve students from several disciplines.  Formulation of outline, literature review, and project schedule.  2 laboratories.",
            "title": "Senior Project Design Laboratory II"
        },
        "ENGR 483": {
            "description": "Continuation of ENGR 482.  Completion of project by individuals or team typical of problems graduates must solve in their fields of employment or applied research.  Project may involve, but is not limited to, physical modeling and testing of integrated design projects, costs, planning, scheduling and research, and may involve students from several disciplines.  Formulation of outline, literature review, and project schedule.  2 laboratories.",
            "title": "Senior Project Design Laboratory III"
        },
        "ENGR 493": {
            "description": "Part-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  Formal report and evaluation by work supervisor required.  Credit/No Credit grading only.  No major credit allowed; total credit limited to 6 units.",
            "title": "Cooperative Education Experience"
        },
        "ENGR 494": {
            "description": "Full-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  Formal report and evaluation by work supervisor required.  Credit/No Credit grading only.  No major credit allowed; total credit limited to 18 units.",
            "title": "Cooperative Education Experience"
        },
        "ENGR 495": {
            "description": "Full-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  A more fully developed formal report and evaluation by work supervisor required.  Credit/No Credit grading only.  No major credit allowed; total credit limited to 24 units.",
            "title": "Cooperative Education Experience"
        },
        "ENGR 500": {
            "description": "Advanced study planned and completed under the direction of faculty.  Open to graduate students who have demonstrated the ability to do independent work.  Total credit limited to 8 units.",
            "title": "Individual Study"
        },
        "ENGR 551": {
            "description": "Current topic in bioengineering research/application in detail, including medical applications and industrial applications.  Takes advantage of capabilities of resident or visiting faculty.  Total credit limited to 16 units.  See The Schedule of Classes for topic selected.  4 lectures.",
            "title": "Advanced Topics in Bioengineering"
        },
        "ENGR 570": {
            "description": "Directed group study of selected topics for graduate students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1-4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "ENGR 571": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1-4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "ENGR 581": {
            "description": "Types of microorganisms and microbially-mediated biochemical reactions for biotechnology applications.  Stoichiometric and thermodynamic principles for microbial growth and metabolism.  Material and energy balances for aerobic and anaerobic growth and bioreactor design.  Kinetics of enzyme catalyzed reactions.  Field trips required.  3 seminars, 1 laboratory.  Crosslisted as ENGR/ENVE 581.",
            "title": "Biochemical Engineering"
        },
        "ENGR 593": {
            "description": "Advanced study analysis and part-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "ENGR 594": {
            "description": "Advanced study analysis and full-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "ENGR 595": {
            "description": "Advanced study analysis and full-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  A fully-developed formal report and evaluation by work supervisor required.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "ENGR 596": {
            "description": "Designed for MS students who are performing a work-for-others research project that requires a Non-disclosure Agreement.  Students who qualify will be required file a detailed, supervised report and undergo an examination on the work performed.  Total credit limited to 9 units.  1 to 9 supervision.",
            "title": "Industry Sponsored Project Experience"
        },
        "ENGR 599": {
            "description": "Each individual or group will select, with faculty guidance and approval, a topic for independent research or investigation resulting in a thesis or project to be used to satisfy the degree requirement.  An appropriate experimental or analytical thesis or project may be accepted.",
            "title": "Design Project (Thesis)"
        }
    },
    "links": [
        {
            "source": "BMED 212",
            "target": "ENGR 334",
            "value": 1
        },
        {
            "source": "ENGR 234",
            "target": "ENGR 334",
            "value": 1
        },
        {
            "source": "IME 144",
            "target": "ENGR 334",
            "value": 1
        },
        {
            "source": "ME 234",
            "target": "ENGR 334",
            "value": 1
        },
        {
            "source": "ME 212",
            "target": "ENGR 400",
            "value": 1
        },
        {
            "source": "ENGR 459",
            "target": "ENGR 460",
            "value": 1
        },
        {
            "source": "ENGR 460",
            "target": "ENGR 461",
            "value": 1
        },
        {
            "source": "ME 212",
            "target": "ENGR 462",
            "value": 1
        },
        {
            "source": "ENGR 463",
            "target": "ENGR 464",
            "value": 1
        },
        {
            "source": "ENGR 464",
            "target": "ENGR 465",
            "value": 1
        },
        {
            "source": "MATH 244",
            "target": "ENGR 481",
            "value": 1
        },
        {
            "source": "IME 314",
            "target": "ENGR 481",
            "value": 1
        },
        {
            "source": "ME 302",
            "target": "ENGR 481",
            "value": 1
        },
        {
            "source": "ENGR 481",
            "target": "ENGR 482",
            "value": 1
        },
        {
            "source": "ENGR 482",
            "target": "ENGR 483",
            "value": 1
        },
        {
            "source": "ENGR 450",
            "target": "ENGR 551",
            "value": 1
        },
        {
            "source": "CHEM 312",
            "target": "ENGR 581",
            "value": 1
        },
        {
            "source": "MCRO 221",
            "target": "ENGR 581",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "ENGR 101"
        },
        {
            "group": 1,
            "id": "ENGR 110"
        },
        {
            "group": 1,
            "id": "ENGR 234"
        },
        {
            "group": 1,
            "id": "ENGR 270"
        },
        {
            "group": 1,
            "id": "ENGR 301"
        },
        {
            "group": 1,
            "id": "ENGR 302"
        },
        {
            "group": 1,
            "id": "ENGR 310"
        },
        {
            "group": 1,
            "id": "ENGR 322"
        },
        {
            "group": 1,
            "id": "ENGR 334"
        },
        {
            "group": 1,
            "id": "ENGR 350"
        },
        {
            "group": 1,
            "id": "ENGR 400"
        },
        {
            "group": 1,
            "id": "ENGR 440"
        },
        {
            "group": 1,
            "id": "ENGR 451"
        },
        {
            "group": 1,
            "id": "ENGR 459"
        },
        {
            "group": 1,
            "id": "ENGR 460"
        },
        {
            "group": 1,
            "id": "ENGR 461"
        },
        {
            "group": 1,
            "id": "ENGR 462"
        },
        {
            "group": 1,
            "id": "ENGR 463"
        },
        {
            "group": 1,
            "id": "ENGR 464"
        },
        {
            "group": 1,
            "id": "ENGR 465"
        },
        {
            "group": 1,
            "id": "ENGR 470"
        },
        {
            "group": 1,
            "id": "ENGR 471"
        },
        {
            "group": 1,
            "id": "ENGR 481"
        },
        {
            "group": 1,
            "id": "ENGR 482"
        },
        {
            "group": 1,
            "id": "ENGR 483"
        },
        {
            "group": 1,
            "id": "ENGR 493"
        },
        {
            "group": 1,
            "id": "ENGR 494"
        },
        {
            "group": 1,
            "id": "ENGR 495"
        },
        {
            "group": 1,
            "id": "ENGR 500"
        },
        {
            "group": 1,
            "id": "ENGR 551"
        },
        {
            "group": 1,
            "id": "ENGR 570"
        },
        {
            "group": 1,
            "id": "ENGR 571"
        },
        {
            "group": 1,
            "id": "ENGR 581"
        },
        {
            "group": 1,
            "id": "ENGR 593"
        },
        {
            "group": 1,
            "id": "ENGR 594"
        },
        {
            "group": 1,
            "id": "ENGR 595"
        },
        {
            "group": 1,
            "id": "ENGR 596"
        },
        {
            "group": 1,
            "id": "ENGR 599"
        },
        {
            "group": 2,
            "id": "BMED 212"
        },
        {
            "group": 3,
            "id": "IME 144"
        },
        {
            "group": 4,
            "id": "ME 234"
        },
        {
            "group": 4,
            "id": "ME 212"
        },
        {
            "group": 5,
            "id": "MATH 244"
        },
        {
            "group": 3,
            "id": "IME 314"
        },
        {
            "group": 4,
            "id": "ME 302"
        },
        {
            "group": 1,
            "id": "ENGR 450"
        },
        {
            "group": 6,
            "id": "CHEM 312"
        },
        {
            "group": 7,
            "id": "MCRO 221"
        }
    ]
}