{
    "descriptions": {
        "GEOL 102": {
            "description": "Processes responsible for the Earth's minerals, rocks, and structure surface features. Volcanism; mountain building; plate tectonics; weathering. Erosion and deposition by streams, glaciers, wind and waves. Geological resources, earth hazards, and interaction of man with global processes. 3 lectures, 1 discussion. Fulfills GE B3.",
            "title": "Introduction to Geology"
        },
        "GEOL 200": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 4 units, with a maximum of 2 units per quarter.",
            "title": "Special Problems for Undergraduates"
        },
        "GEOL 201": {
            "description": "Processes responsible for the Earth's rocks, structural surface features, geologic hazards, and natural resources, with emphasis on interactions with human activities.  3 lectures.",
            "title": "Physical Geology"
        },
        "GEOL 203": {
            "description": "Fossil record. Geologic time scale. Evolution and the fossil record. Evolution - creation controversy. Early earth and early life. Features, lifestyles, origins, and histories of major invertebrate, vertebrate, and plant groups. Mass extinctions. 3 lectures, 1 discussion. Fulfills GE B5.",
            "title": "Fossils and the History of Life"
        },
        "GEOL 205": {
            "description": "World-wide seismicity and plate tectonics. Seismic waves and their recording. Earth structure and composition. Intensity, magnitude, and energy. Major California faults and earthquakes. Paleoseismology, forecasting and prediction. Acceleration, resonance, and effects of ground shaking on structures. Earthquake safety. Tsunamis. 3 lectures, 1 discussion. Fulfills GE B3.",
            "title": "Earthquakes"
        },
        "GEOL 206": {
            "description": "Field trips to places of geologic interest. The Schedule of Classes will indicate destinations. Students must provide their own transportation, food, and camping equipment. May be repeated for a maximum of 3 units provided field trips are taken to different locations. Credit/No Credit grading only. 1 laboratory.",
            "title": "Geologic Excursions"
        },
        "GEOL 241": {
            "description": "Properties and identification of minerals and rocks.  Topographic maps and landform analysis.  Geologic maps and interpretation of rock structure.  1 laboratory.",
            "title": "Physical Geology Laboratory"
        },
        "GEOL 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "GEOL 305": {
            "description": "Theory of plate tectonics.  Elastic waves in layered media.  Principle of the seismometer.  Seismic properties, structure and composition throughout the Earth.  Intensity, magnitude, and seismic moment and energy calculations.  Major California faults and earthquakes.  Paleoseismology, forecasting and prediction.  Analysis of ground motion.  Resonance.  Effects of ground shaking on structures and bodies of water.  Earthquake safety.  Field trip required.  3 lectures, 1 laboratory.  Fulfills GE B6.",
            "title": "Fundamentals of Seismology"
        },
        "GEOL 310": {
            "description": "Processes associated with melting, igneous crystallization, and metamorphism of igneous and sedimentary rocks.  Special attention to relationships with tectonic setting.  Required field trip.  3 lectures, 1 laboratory.",
            "title": "Igneous and Metamorphic Petrology"
        },
        "GEOL 330": {
            "description": "Description and analysis of stratified rock and sediment.  Sedimentology, diagenesis, transgressive/regressive sequences, bedform interpretation, marine and terrestrial sediment and sedimentary-rock sequence interpretation, and sequence stratigraphy.  Required field trips.  3 lectures, 1 laboratory.",
            "title": "Principles of Stratigraphy"
        },
        "GEOL 400": {
            "description": "Individual investigations, research, studies, or surveys of selected problems.  Total credit limited to 4 units, with a maximum of 2 units per quarter.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "GEOL 401": {
            "description": "Collecting and interpreting field-geologic data.  Description of sedimentary rocks and construction of stratigraphic columns.  Mapping geologic structures in the field.  Surficial geologic stratigraphy and surficial geologic mapping.  Understanding geologic processes through field study.  Communicating results of field study.  1 lecture, 3 activities.  Crosslisted as ERSC/GEOL 401.",
            "title": "Field-Geology Methods"
        },
        "GEOL 402": {
            "description": "Bedrock geologic mapping on topographic maps and aerial photos.  Surficial geologic mapping on topographic maps and aerial photos.  Correlating and defining surficial geologic map units on the basis of soil development.  Understanding landscape evolution using soil development 4 activities.  Crosslisted as ERSC/GEOL 402.",
            "title": "Geologic Mapping"
        },
        "GEOL 404": {
            "description": "Individual investigations, research, studies, or surveys of selected problems.  Credit/No Credit grading only.  Total credit limited to 4 units, with a maximum of 2 units per quarter.",
            "title": "Research Experience for Advanced Undergraduates"
        },
        "GEOL 415": {
            "description": "Recognition, interpretation, and depiction of geological structures.  Understanding rock deformation through the study of faults and folds.  3 lectures, 1 laboratory.  Required weekend field trips.",
            "title": "Structural Geology"
        },
        "GEOL 420": {
            "description": "Introduction to geophysical exploration of the shallow subsurface:  seismic refraction, seismic reflection, electrical resistivity, magnetic and gravity methods.  Application to determination of subsurface structure, groundwater and mineral resources.  Field trip required.  2 lectures, 1 laboratory.",
            "title": "Applied Geophysics"
        },
        "GEOL 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "GEOL 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 laboratories.",
            "title": "Selected Advanced Laboratory"
        }
    },
    "links": [
        {
            "source": "MATH 119",
            "target": "GEOL 201",
            "value": 1
        },
        {
            "source": "PHYS 141",
            "target": "GEOL 305",
            "value": 1
        },
        {
            "source": "GEOL 201",
            "target": "GEOL 305",
            "value": 1
        },
        {
            "source": "PHYS 132",
            "target": "GEOL 305",
            "value": 1
        },
        {
            "source": "GEOL 102",
            "target": "GEOL 310",
            "value": 1
        },
        {
            "source": "GEOL 201",
            "target": "GEOL 310",
            "value": 1
        },
        {
            "source": "ERSC 223",
            "target": "GEOL 310",
            "value": 1
        },
        {
            "source": "GEOL 102",
            "target": "GEOL 330",
            "value": 1
        },
        {
            "source": "GEOL 201",
            "target": "GEOL 330",
            "value": 1
        },
        {
            "source": "GEOL 241",
            "target": "GEOL 330",
            "value": 1
        },
        {
            "source": "GEOL 102",
            "target": "GEOL 401",
            "value": 1
        },
        {
            "source": "GEOL 201",
            "target": "GEOL 401",
            "value": 1
        },
        {
            "source": "GEOL 241",
            "target": "GEOL 401",
            "value": 1
        },
        {
            "source": "GEOL 415",
            "target": "GEOL 401",
            "value": 1
        },
        {
            "source": "ERSC 223",
            "target": "GEOL 401",
            "value": 1
        },
        {
            "source": "ERSC 323",
            "target": "GEOL 401",
            "value": 1
        },
        {
            "source": "GEOL 401",
            "target": "GEOL 402",
            "value": 1
        },
        {
            "source": "GEOL 241",
            "target": "GEOL 415",
            "value": 1
        },
        {
            "source": "ERSC 223",
            "target": "GEOL 415",
            "value": 1
        },
        {
            "source": "GEOL 201",
            "target": "GEOL 420",
            "value": 1
        },
        {
            "source": "PHYS 141",
            "target": "GEOL 420",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "GEOL 102"
        },
        {
            "group": 1,
            "id": "GEOL 200"
        },
        {
            "group": 1,
            "id": "GEOL 201"
        },
        {
            "group": 1,
            "id": "GEOL 203"
        },
        {
            "group": 1,
            "id": "GEOL 205"
        },
        {
            "group": 1,
            "id": "GEOL 206"
        },
        {
            "group": 1,
            "id": "GEOL 241"
        },
        {
            "group": 1,
            "id": "GEOL 270"
        },
        {
            "group": 1,
            "id": "GEOL 305"
        },
        {
            "group": 1,
            "id": "GEOL 310"
        },
        {
            "group": 1,
            "id": "GEOL 330"
        },
        {
            "group": 1,
            "id": "GEOL 400"
        },
        {
            "group": 1,
            "id": "GEOL 401"
        },
        {
            "group": 1,
            "id": "GEOL 402"
        },
        {
            "group": 1,
            "id": "GEOL 404"
        },
        {
            "group": 1,
            "id": "GEOL 415"
        },
        {
            "group": 1,
            "id": "GEOL 420"
        },
        {
            "group": 1,
            "id": "GEOL 470"
        },
        {
            "group": 1,
            "id": "GEOL 471"
        },
        {
            "group": 2,
            "id": "MATH 119"
        },
        {
            "group": 3,
            "id": "PHYS 141"
        },
        {
            "group": 3,
            "id": "PHYS 132"
        },
        {
            "group": 4,
            "id": "ERSC 223"
        },
        {
            "group": 4,
            "id": "ERSC 323"
        }
    ]
}