{
    "descriptions": {
        "HNRS 100": {
            "description": "Topics on sustainability, diversity, ethics, and transition to life at Cal Poly. Introduction to Honors Program opportunities. Mentoring and building community. Collaboration with local service organizations. For University Honors Program students only. Credit/No Credit grading only. 1 lecture, 1 activity.",
            "title": "Introduction to the Honors Community"
        },
        "HNRS 101": {
            "description": "Introduction to the principles of public speaking. Practical experience in the development, presentation, and critical analysis of speeches to inform, to persuade, and to actuate. Not open to students with credit in COMS 102. 4 lectures. Crosslisted as COMS/HNRS 101. Fulfills GE A2; for students admitted Fall 2016 or later a grade of C- or better is required to fulfill GE Area A2.",
            "title": "Public Speaking"
        },
        "HNRS 102": {
            "description": "Introduction to the fundamentals and principles which underlie effective oral communication. Practical experience in various types of speaking situations: informative speaking, persuasive speaking, and panel discussion. Not open to students with credit in COMS 101. 4 lectures. Crosslisted as COMS/HNRS 102. Fulfills GE A2; for students admitted Fall 2016 or later a grade of C- or better is required to fulfill GE Area A2.",
            "title": "Principles of Oral Communication"
        },
        "HNRS 112": {
            "description": "Introductory and interdisciplinary study of the ways that race and ethnicity are created by both historical processes and American institutional formation - specifically social, political, economic, legal and cultural institutions. Special attention paid to the interlocking systems of race, class, gender and sexuality. 4 lectures. Crosslisted as ES/HNRS 112. Fulfills GE D1 and USCP.",
            "title": "Race, Culture and Politics in the United States"
        },
        "HNRS 131": {
            "description": "Fundamental principles of mechanics.  Vectors, particle kinematics.  Equilibrium of a rigid body.  Work and energy, linear momentum, rotational kinematics and dynamics.  Primarily for engineering students, and for students majoring in the physical sciences.  Not open to students with credit in PHYS 141.  3 lectures, 1 laboratory.  Crosslisted as HNRS/PHYS 131.  Fulfills GE B3 & B4.",
            "title": "General Physics I"
        },
        "HNRS 132": {
            "description": "Oscillations, waves in elastic media, sound waves.  Temperature, heat and the first law of thermodynamics.  Kinetic theory of matter, second law of thermodynamics.  Geometrical and physical optics.  3 lectures, 1 laboratory.  Crosslisted as HNRS/PHYS 132.  Fulfills GE B3 & B4.",
            "title": "General Physics II"
        },
        "HNRS 134": {
            "description": "Fundamental principles of mechanics.  Vectors, particle kinematics.  Equilibrium of a rigid body.  Work and energy, linear momentum, rotational kinematics and dynamics.  Primarily for engineering and science students.  Not open to students with credit in PHYS 131.  4 lectures.  Crosslisted as HNRS 134/PHYS 141.  Fulfills GE B3.",
            "title": "General Physics IA"
        },
        "HNRS 141": {
            "description": "Limits, continuity, differentiation.  Introduction to integration.  4 lectures.  Crosslisted as HNRS/MATH 141.  Fulfills GE Area B1; for students admitted Fall 2016 or later, a grade of C- or better in one GE Area B1 course is required to fulfill GE Area B.",
            "title": "Calculus I"
        },
        "HNRS 142": {
            "description": "Techniques of integration, applications to physics, transcendental functions.  4 lectures.  Crosslisted as HNRS/MATH 142.  Fulfills GE B1; for students admitted Fall 2016 or later, a grade of C- or better in one GE B1 course is required to fulfill GE Area B.",
            "title": "Calculus II"
        },
        "HNRS 143": {
            "description": "Infinite sequences and series, vector algebra, curves.  4 lectures.  Crosslisted as HNRS/MATH 143.  Fulfills GE B1; for students admitted Fall 2016 or later, a grade of C- or better in one GE B1 course is required to fulfill GE Area B.",
            "title": "Calculus III"
        },
        "HNRS 145": {
            "description": "The principles of reasoning in argumentation.  Examination of rhetorical principles and responsible rhetorical behavior.  Application of these principles to written and oral communications.  Effective use of research methods and sources.  4 lectures.  Crosslisted as COMS/ENGL/HNRS 145.  Fulfills GE A3; for students admitted Fall 2016 or later a grade of C- or better is required to fulfill GE Area A3.",
            "title": "Reasoning, Argumentation, and Writing"
        },
        "HNRS 148": {
            "description": "The principles of reasoning in professional writing.  Discussion and application of rhetorical principles, both oral and written, in professional environments.  Study of methods, resources and common formats used in corporate or research writing.  4 lectures.  Crosslisted as ENGL/HNRS 148.  Fulfills GE A3; for students admitted Fall 2016 or later a grade of C- or better is required to fulfill GE Area A3.",
            "title": "Reasoning, Argumentation and Professional Writing"
        },
        "HNRS 149": {
            "description": "The principles of technical writing.  Discussion and application of rhetorical principles in technical environments.  Study of methods, resources and common formats used in corporate or research writing.  4 lectures.  Crosslisted as ENGL/HNRS 149.  Fulfills GE A3; for students admitted Fall 2016 or later a grade of C- or better is required to fulfill GE Area A3.",
            "title": "Technical Writing for Engineers"
        },
        "HNRS 161": {
            "description": "Environmental, historical, and social dimensions of sustainability. Elements of sustainable communities in a local and global context. Resilience and systems thinking. Introduction to research skills. Developing community within the Honors Program. Includes a service learning component. For University Honors Program students only. 1 lecture, 1 activity. Upon completion of HNRS 161 and HNRS 162, a student will receive 4 units of GE credit for Area D3.",
            "title": "Creating Sustainable Communities I"
        },
        "HNRS 162": {
            "description": "Continuation of HNRS 161.  Environmental, historical, and social dimensions of sustainability.  Institutional views of sustainability.  Environmental justice.  Appropriate technology.  Developing community within the Honors Program.  Includes a service learning component.  For University Honors Program students only.  1 lecture, 1 activity.",
            "title": "Creating Sustainable Communities II"
        },
        "HNRS 163": {
            "description": "Continuation of HNRS 161 and 162.  Implementation and assessment of a year-long community service project, initiative, or campaign.  Project management and interpersonal communication.  Developing community within the Honors Program.  For University Honors Program students only.  1 lecture, 1 activity.",
            "title": "Creating Sustainable Communities III"
        },
        "HNRS 200": {
            "description": "Individual investigation, research, projects, or surveys of selected problems.  Total credit limited to 4 units, with a maximum of 2 units per quarter.  Credit/No Credit grading only.",
            "title": "Special Problems for Undergraduates"
        },
        "HNRS 201": {
            "description": "Basic principles of microeconomics and macroeconomics. Emphasis on applications to current national and global economic issues. For majors requiring one quarter of economics. Not open to students having previous credit in ECON 222 or equivalent. 4 lectures. Crosslisted as ECON/HNRS 201. Fulfills GE D2.",
            "title": "Survey of Economics"
        },
        "HNRS 202": {
            "description": "Survey of the second half of U.S. history, including reconstruction, industrialization, the regulatory state, foreign affairs, and the remaking of citizenship rights and society. Particular attention to how race, class, and gender shaped changing definitions of freedom and equality. Not open to students with credit in HIST 206 or HIST 207. 4 lectures. Crosslisted as HIST/HNRS 202. Fulfills GE Area D1 and USCP.",
            "title": "United States History Since 1865"
        },
        "HNRS 203": {
            "description": "Survey of the first half of U.S. history, including: contact and settlement, American Revolution, slavery, westward expansion, early California, Civil War, and California and U.S. Constitutions. Particular attention to how race, class, and gender shaped changing definitions of freedom and equality. Not open to students with credit in HIST 206 or HIST 207. 4 lectures. Crosslisted as HIST 201/HNRS 203. Fulfills D1 and USCP.",
            "title": "United States History to 1865"
        },
        "HNRS 204": {
            "description": "Introduction to theories and research on how genders and sexualities in the US shape and are shaped by historical processes and US institutional formation - specifically social, political, economic, legal, cultural institutions. Emphasis on interlocking systems of gender, sexuality, race and class. 4 lectures. Crosslisted as HNRS 204/WGS 201. Fulfills GE Area D1 and USCP.",
            "title": "Introduction to Women's and Gender Studies in the United States"
        },
        "HNRS 207": {
            "description": "The multiple and conflicting ways in which various Americans (defined in terms of race, class and gender) have struggled to formulate and promote their own understandings of freedom and equality, from the pre-conquest era to the present. 4 lectures. Not open to students with credit in HIST 201 or HIST 202. Crosslisted as HIST/HNRS 207. Fulfills GE D1 and USCP.",
            "title": "Freedom and Equality in American History"
        },
        "HNRS 211": {
            "description": "Analysis of forces on engineering structures in equilibrium.  Properties of forces, moments, couples, and resultants.  Equilibrium conditions, friction, centroids, area moments of inertia.  Introduction to mathematical modeling and problem solving.  Vector mathematics where appropriate.  3 lectures.  Crosslisted as HNRS/ME 211.",
            "title": "Engineering Statics"
        },
        "HNRS 212": {
            "description": "How the global dispersal of Europeans, Asians, and Africans, the hemispheric dispersal of Latin Americans, and the forced internal migration of Native Americans have contributed to American cultural heritage and the struggles for ethnic, class and gender equality, and justice. 4 lectures. Crosslisted as ES/HNRS 212. Fulfills GE D3 and USCP.",
            "title": "Global Origins of United States Cultures"
        },
        "HNRS 213": {
            "description": "The relationship between states and economies in the modern period. Themes of modernization, industrialization, and colonial expansion. The  major theories of political economy, especially liberalism and socialism. 4 lectures. Crosslisted as HIST/HNRS 213. Fulfills GE D2.",
            "title": "Modern Political Economy"
        },
        "HNRS 214": {
            "description": "Analysis of motions of particles and rigid bodies encountered in engineering.  Velocity, acceleration, relative motion, work, energy, impulse, and momentum.  Further development of mathematical modeling and problem solving.  Vector mathematics where appropriate.  3 lectures.  Crosslisted as HNRS 214/ME 212.",
            "title": "Engineering Dynamics"
        },
        "HNRS 216": {
            "description": "History of global social movements from the late nineteenth century to the present. May include, but not limited to: socialism, nationalism, feminism, fascism and communism, pacifism, life reform, gay liberation, indigenous peoples' movements, and environmentalism. Includes a service learning component. 4 lectures. Crosslisted as HIST/HNRS 216. Fulfills GE D3.",
            "title": "Comparative Social Movements"
        },
        "HNRS 223": {
            "description": "Comparative history of Western and non-Western societies in global perspective. Cross-cultural exchange, interaction, and conflict in the making of the modern world, with focus on the economic, political, and cultural transformations that facilitated and emerged from imperialism. 4 lectures. Crosslisted as HIST/HNRS 223. Fulfills GE D3.",
            "title": "World History, 1800 - Present"
        },
        "HNRS 230": {
            "description": "Critical examination of primary philosophical texts, from the ancient and modern periods, with focus on the nature of reality and the sources and limits of human knowledge.  4 lectures.  Crosslisted as HNRS/PHIL 230.  Fulfills GE C2.",
            "title": "Philosophical Classics: Knowledge and Reality"
        },
        "HNRS 231": {
            "description": "Readings from primary philosophical texts, from the ancient and modern periods, with focus on the identification, evaluation and contemporary relevance of the central ethical and political themes and arguments presented in them.  Course may be offered in classroom-based or online format.  4 lectures.  Crosslisted as HNRS/PHIL 231.  Fulfills GE C2.",
            "title": "Philosophical Classics: Ethics and Political Philosophy"
        },
        "HNRS 232": {
            "description": "Broadly surveys Romantic, Victorian, Modern, and Contemporary British literature in an historical-cultural context.  Investigates works from several genres and a variety of national and cultural voices.  May include such writers as Wordsworth, Wollstonecraft, Dickens, G.  Eliot, Wilde, Woolf, Yeats, and Gordimer.  4 lectures.  Crosslisted as ENGL 231/HNRS 232.  Fulfills GE C1.",
            "title": "Masterworks of British Literature from the Late 18th Century to the Present"
        },
        "HNRS 241": {
            "description": "Partial derivatives, multiple integrals, introduction to vector analysis.  4 lectures.  Crosslisted as HNRS/MATH 241.",
            "title": "Calculus IV"
        },
        "HNRS 242": {
            "description": "A broad survey of later American literature from the rise of literary nationalism to the present.  A wide range of writers and genres, including novels, short stories, poems, plays, essays, and autobiographies.  Not open to students with credit in ENGL 240.  4 lectures.  Crosslisted as ENGL/HNRS 242.  Fulfills GE C1.",
            "title": "American Literature: 1830 to the Present"
        },
        "HNRS 244": {
            "description": "Separable and linear ordinary differential equations with selected applications; numerical and analytical solutions.  Linear algebra:  vectors in n-space, matrices, linear transformations, eigenvalues, eigenvectors, diagonalization; applications to the study of systems of linear differential equations.  4 lectures.  Crosslisted as HNRS/MATH 244.",
            "title": "Linear Analysis I"
        },
        "HNRS 251": {
            "description": "Examination of the ancient epics and classical literature of Mesopotamia, Greece, and Rome.  May include such readings as The Epic of Gilgamesh, the Iliad, the Odyssey, Genesis, Exodus, Antigone, the Symposium, the Aeneid, and Marcus Aurelius's Meditations.  4 lectures.  Crosslisted as ENGL/HNRS 251.  Fulfills GE C1.",
            "title": "Great Books I: Introduction to Classical Literature"
        },
        "HNRS 261": {
            "description": "Interpersonal leadership and communication skills with a focus on self evaluation.  Personality assessment, preparation of a personal leadership development plan, and goal setting.  Values and moral development.  For University Honors Program students only.  1 activity.",
            "title": "Leadership: Self Evaluation"
        },
        "HNRS 262": {
            "description": "Teamwork and team building skills with a focus on group dynamics.  Understanding the effects of diversity on team dynamics and performance.  Cross-cultural communication and leadership.  Development of trust, feedback, and conflict resolution.  For University Honors Program students only.  1 lecture.",
            "title": "Leadership: Group Dynamics"
        },
        "HNRS 263": {
            "description": "Strategies for effective coaching and mentoring.  Servant leadership, recognition of motivational sources in others, and positive psychology in leadership.  Development of a leadership philosophy.  For University Honors Program students only.  1 lecture.",
            "title": "Leadership: Coaching and Mentoring"
        },
        "HNRS 265": {
            "description": "Identifying information resources and research support services available through Kennedy Library.  Methods, best-practices, and ethical standards related to planning, carrying out, summarizing, and publishing scholarly research.  Written, oral, and visual presentation of research findings.  For University Honors Program students only.  1 lecture, 1 activity.",
            "title": "Research and Information Skills for Honors Students"
        },
        "HNRS 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "HNRS 299": {
            "description": "Students in the Honors Program are required to take at least eight courses for honors credit before graduation. Taking an Honors course may not be possible due to scheduling conflicts or unavailability of courses. This course allows students to engage in honors-level work in a standard, non-honors course on a group basis. Credit/No Credit grading only. Total credit limited to 4 units; repeatable in same term. Must achieve a B or better in the related standard course. 1 seminar.",
            "title": "Honors Group Seminar"
        },
        "HNRS 302": {
            "description": "Early teaching experience in an informal science, technology, engineering, and mathematics (STEM) teaching and learning environment.  Principles of inquiry-driven STEM education, lesson design, implementation and assessment.  Intended for undergraduates exploring STEM teaching as a career.  Total credit limited to 4 units.  Credit/No Credit grading only.  1 seminar, 1 laboratory.  Crosslisted as ENGR 322/SCM 302/HNRS 302.",
            "title": "The Learn By Doing Lab Teaching Practicum"
        },
        "HNRS 303": {
            "description": "Economic analysis of the cause, extent and impact of poverty, discrimination and immigration and of the policies designed to address these socioeconomic issues.  Emphasis on the experience of African-Americans, Latinos, and women in the United States.  4 lectures.  Crosslisted as ECON/HNRS 303.  Fulfills GE D5 except for Economics majors.  Fulfills USCP.",
            "title": "Economics of Poverty, Discrimination and Immigration"
        },
        "HNRS 304": {
            "description": "Humanistic investigation into the theoretical and practical applications of technology with specific reference to the social effects of technological change.  For all majors.  Non-technical.  4 lectures.  Crosslisted as HNRS 304/ISLA 303.  Fulfills GE C4.",
            "title": "Values and Technology"
        },
        "HNRS 310": {
            "description": "Technological innovations that have led to modern aircraft and spacecraft as viewed from an historical perspective.  Development of aerodynamics, propulsion systems, light-weight structures, and control systems.  How aviation has affected, and been affected by, history.  Impact of aviation on society, including civil and military aircraft/spacecraft.  Federal regulation of aviation, including air traffic control and airlines.  Future developments in air and space technology.  4 lectures.  Crosslisted as AERO/HNRS 310.  Fulfills GE Area F.",
            "title": "Air and Space"
        },
        "HNRS 311": {
            "description": "How computers and computer devices work.  Introduction to software systems and applications.  How computers connect with various media including images, speech and data.  How information is encoded and transmitted across networks.  Relationship between the computer and human information processing.  4 lectures.  Crosslisted as CSC 310/HNRS 311.  Fulfills GE Area F.",
            "title": "Computers for Poets"
        },
        "HNRS 312": {
            "description": "The pre-modern and modern histories of China and Japan.  Focus on the traditional era, the transition to modernity, cultural uniqueness within East Asian civilization, and western images of Asia.  4 lectures.  Crosslisted as HIST 310/HNRS 312.  Fulfills GE D5 except for History majors.",
            "title": "East Asian Culture and Civilization"
        },
        "HNRS 317": {
            "description": "The history of the sea, people who travel across it, live alongside or in the midst of it, or simply seek it out.  Topics include imperialism, maritime commerce, port cities, littoral societies, piracy, tourism, popular culture.  4 lectures.  Crosslisted as HIST/HNRS 317.  Fulfills GE D5 except for History majors.",
            "title": "The Lure of the Sea"
        },
        "HNRS 320": {
            "description": "The interplay of values, media, and culture from an interdisciplinary perspective.  Descriptive subtitles assigned to each course.  The Schedule of Classes will list topic selected.  4 lectures.  Total credit limited to 8 units with different subtopic; repeatable in same term.  Crosslisted as HNRS/ISLA 320.  Fulfills GE C4.",
            "title": "Topics and Issues in Values, Media and Culture"
        },
        "HNRS 321": {
            "description": "Research methods and tools for sciences and humanities, including formulating a research question, designing a study, using the scientific method to conduct and analyze surveys, and analyzing data.  Emphasis on working in interdisciplinary research teams.  Total credit limited to 8 units.  2 lectures, 2 activities.  Crosslisted as HNRS/UNIV 321.",
            "title": "Undergraduate Research Methods and Practice"
        },
        "HNRS 322": {
            "description": "Theory and practice in leadership and project management skills for engineering design teams.  Basic issues related to, and tools used for, managing projects and concepts comprising project management.  Emphasis on situations requiring resolutions and management decisions by groups representing various elements of an enterprise.  2 lectures.  Crosslisted as HNRS/IME 322.",
            "title": "Leadership and Project Management"
        },
        "HNRS 323": {
            "description": "American history since 1900.  Focus on domestic and foreign policy interactions, struggle of disenfranchised groups for social and political equality, and changes in culture and identity.  4 lectures.  Crosslisted as HIST 322/HNRS 323.  Fulfills GE D5 except for History majors.",
            "title": "Modern America"
        },
        "HNRS 324": {
            "description": "An introduction to the historical novel as it has developed in the United States since the 1960s.  Exploration of how historical novels typically represent the past and the ways in which they change our notion of what counts as 'history.' 4 lectures.  Crosslisted as HIST/HNRS 324.  Fulfills GE D5 except for History majors.",
            "title": "The Historical Novel in the United States, 1960s to the Present"
        },
        "HNRS 332": {
            "description": "In-depth exploration of the dominant themes and preoccupations of the Age of Enlightenment.  Historical and cultural contexts of canonical and non-canonical literature emphasized to illustrate 18th century Britons' views of themselves and their changing world.  May include such writers as Dryden, Behn, Defoe, Swift, Pope, and Johnson.  4 lectures.  Crosslisted as ENGL/HNRS 332.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "British Literature in the Age of Enlightenment: 1660-1798"
        },
        "HNRS 333": {
            "description": "In-depth exploration of the literature of the British Romantic period.  Cultural, historical, and philosophic contexts will also be examined in both canonical and non-canonical works.  May include such writers as Blake, Wordsworth, Keats, and Wollstonecraft.  4 lectures.  Crosslisted as ENGL/HNRS 333.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "British Literature in the Age of Romanticism: 1798-1832"
        },
        "HNRS 334": {
            "description": "Europe's 'long nineteenth century' reveals continuity and dramatic changes in politics, social structures and identities, forms of cultural expression, and scientific and technological knowledge.  Topics include the French and Industrial revolutions; liberalism; nationalism; socialism; modernism; imperialism; and World War I.  4 lectures.  Crosslisted as HIST/HNRS 334.  Fulfills GE D5 except for History majors.",
            "title": "Modern Europe, 1789-1914"
        },
        "HNRS 335": {
            "description": "Examination of twentieth-century European history.  Topics include:  First World War, World Economic Crisis, communism, fascism, mass culture, shifting gender roles, Second World War, Cold War, Velvet Revolution, and the European Union.  4 lectures.  Crosslisted as HIST/HNRS 335.  Fulfills GE D5 except for History majors.",
            "title": "Modern Europe, 1914-Present"
        },
        "HNRS 336": {
            "description": "Examination of contemporary moral problems, solutions to these problems, and the arguments for these solutions, with emphasis on two or more of the following sample problem areas:  abortion, suicide and euthanasia, capital punishment, family ethics, race relations, social justice, war, women's issues.  4 lectures.  Crosslisted as PHIL 335/HNRS 336.  Fulfills GE C4 except for Philosophy majors.  Fulfills USCP.",
            "title": "Social Ethics"
        },
        "HNRS 338": {
            "description": "Examination of significant social, legal, economic and political issues that face the country and how the basic institutions of government-national, state, local-are responding to them; assessment of policies to correct these problems.  4 lectures.  Crosslisted as HNRS/POLS 338.  Fulfills GE D5 except for Political Science majors.",
            "title": "Critical Issues in American Politics"
        },
        "HNRS 340": {
            "description": "Sexuality in a cultural and historical context.  Changing definitions of human subjectivity.  The cultural and social regimes that control and create sexuality (including the 'invention' of homo/heterosexuality and the social, legal and political systems that define sexual ab/normality).  Contemporary issues of sexual orientation and topics of sexuality in relation to gender and race.  4 seminars.  Crosslisted as WGS/HNRS 340.  Fulfills GE D5.",
            "title": "Sexuality Studies"
        },
        "HNRS 341": {
            "description": "Analysis of literary Realism and Naturalism in their cultural and historical contexts.  May include such writers as Whitman, Dickinson, Twain, Chopin, James, Wharton, Dreiser, Norris, and Crane who are seen to accommodate the sense of danger, doubt, and disorder of the time.  4 lectures.  Crosslisted as ENGL/HNRS 341.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "The Literary Sources of the American Character: 1865-1914"
        },
        "HNRS 342": {
            "description": "The writers of the modern period and those of the early post-modern age, including writers marked by stylistic innovation and a willingness to challenge traditionally accepted standards.  May include such writers as Hemingway, Fitzgerald, Stein, Hughes.  4 lectures.  Crosslisted as ENGL/HNRS 342.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "The Literary Sources of the American Character: 1914-1956"
        },
        "HNRS 343": {
            "description": "In-depth study of American fiction, poetry, and drama written since 1956.  How contemporary literature examines enduring American themes and breaks new ground with the inclusion of diverse voices.  4 lectures.  Crosslisted as ENGL/HNRS 343.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "Multiple Voices of Contemporary American Literature"
        },
        "HNRS 345": {
            "description": "In-depth exploration of works of 20th century women authors within their historical and cultural contexts.  Analysis of canonical and non-canonical writing by women of differing classes, races, ethnicities, and sexual preferences.  Literary techniques through which texts reflect or challenge such cultural constructs as gender, identity, sexuality, motherhood, etc.  The emergence of a female literary tradition.  May include such writers as Woolf, Rich, Kingston, Yamamoto, Morrison, Cervantes.  4 lectures.  Crosslisted as ENGL/HNRS 345.  Fulfills GE C4 except for English majors.  Fulfills USCP.  Fulfills GWR for students with junior standing (90 units).",
            "title": "Women Writers of the Twentieth Century"
        },
        "HNRS 347": {
            "description": "The writings of African Americans from the end of the eighteenth century to the present.  Individual works and literary trends among African Americans of various periods and contexts:  intellectual, political, and cultural.  4 lectures.  Crosslisted as ENGL/HNRS 347.  Fulfills GE C4 except for English majors.  Fulfills USCP.  Fulfills GWR for students with junior standing (90 units).",
            "title": "African American Literature"
        },
        "HNRS 350": {
            "description": "History of the intellectual, social, and cultural changes in the early modern period known as the 'Scientific Revolution.' Main topics include the Copernican Revolution, mechanical philosophy, natural history, and the social and material practices of early modern science.  4 lectures.  Crosslisted as HIST/HNRS 350.  Fulfills GE D5 except for History majors.",
            "title": "The Scientific Revolution, c"
        },
        "HNRS 352": {
            "description": "Reading and analysis of world drama of the last 150 years, thereby enhancing student awareness of modern culture, history, ethics, politics, and the human condition.  Design work, multi-media forms, art, music, and cinema as components or informing elements of the works under consideration.  4 lectures.  Crosslisted as ENGL/HNRS 352.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "Modern Drama"
        },
        "HNRS 353": {
            "description": "Interdisciplinary examination of the complex relationships between gender, race, culture, science, technology in educational, work, knowledge production, policy, and ethical contexts.  Topics may include reproductive, medical, genetic, and emerging technologies and exploration of efforts to create more socially responsible science/technology.  3 lectures, 1 activity.  Crosslisted as ES 350/HNRS 353/WGS 350.  Fulfills GE Area F and USCP.",
            "title": "Gender, Race, Culture, Science and Technology"
        },
        "HNRS 361": {
            "description": "Completion of an approved Honors experience track in research, international study, or community service.  Personal reflection on the experience.  Peer evaluation.  Presentation of the experience to the Honors and greater Cal Poly communities.  For University Honors Program students only.  1 lecture.",
            "title": "Honors Track - Research, International, and Community Service Experience"
        },
        "HNRS 380": {
            "description": "Literature selected according to a particular theme.  Emphasis on critical interpretation, aesthetic appreciation, and historical and cultural contexts.  The Schedule of Classes will list topic selected.  Total credit limited to 12 units.  4 lectures.  Crosslisted as ENGL/HNRS 380.  Fulfills GE C4 except for English majors.  Fulfills GWR for students with junior standing (90 units).",
            "title": "Literary Themes"
        },
        "HNRS 391": {
            "description": "A broad overview of international development and appropriate design for sustainability.  Besides traditional classroom work, students work in teams to address problems with technical solutions.  Collaboration with mentors from the university, private sector, and nonprofits serves to provide diverse background and project mentorship.  4 lectures.  Crosslisted as HNRS/PSC/UNIV 391.  Fulfills GE D5.",
            "title": "Appropriate Technology for the World's People: Development"
        },
        "HNRS 392": {
            "description": "Addresses the needs of international impoverished communities with technological solutions, which are inexpensive, ecologically sustainable, and socially appropriate.  Group study of target communities, and design and construction of an appropriate technology prototype.  Not open to students with credit in PSC/UNIV/HNRS 492.  3 lectures, 1 laboratory.  Crosslisted as HNRS/PSC/UNIV 392.  Fulfills GE Area F.",
            "title": "Appropriate Technology for the World's People: Design"
        },
        "HNRS 400": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 4 units, with a maximum of 2 units per quarter.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "HNRS 411": {
            "description": "Advanced-level presentation of new media theory, design and practice.  Topics covered include, but are not limited to, interactivity theory, user-centered system design, cognitive psychology, media analysis, and basic web design theory.  Total credit limited to 8 units.  4 lectures.  Crosslisted as ENGL/HNRS 411.",
            "title": "New Media Arts I"
        },
        "HNRS 412": {
            "description": "Advanced level of work with the primary technologies and design/critique theories currently at use in the professional creation of new media works.  Lectures and readings expand upon material presented in ENGL 411.  4 lectures.  Crosslisted as ENGL/HNRS 412.",
            "title": "New Media Arts II"
        },
        "HNRS 424": {
            "description": "The design and creation of educational museum displays that highlight science, engineering, and technology.  Projects done by multidisciplinary teams and for clients in the community.  Emphasis on design, teamwork, service learning and project management.  3 lectures, 1 laboratory.  Crosslisted as HNRS/UNIV 424.",
            "title": "Design of Museum Displays of Science, Engineering and Technology"
        },
        "HNRS 450": {
            "description": "Engineering principles, design, and installation of solar photovoltaic power systems including grid-tie and off-grid systems.  Photonic energy conversion, solar module engineering, solar power electronics, photovoltaic site planning, mechanical and structural considerations, permit processes, government incentives, and analysis of financial and investment issues.  Field trips required.  3 lectures, 1 laboratory.  Crosslisted as BRAE/EE/HNRS 450.",
            "title": "Solar Photovoltaic System Engineering"
        },
        "HNRS 461": {
            "description": "Forum for graduating seniors to share their Honors experiences.  Presentation and defense of a capstone project or experience before a diverse group of subject experts and laypersons.  Seminars on communication and career guidance.  For University Honors Program students only.  Credit/No Credit grading only.  1 seminar.",
            "title": "Honors Capstone Seminar"
        },
        "HNRS 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "HNRS 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "HNRS 475": {
            "description": "Typical modules related to sustainable forest management, ecosystem sampling and inventory methods, photo interpretation, hydrologic resources, road condition, project impact analysis, best management practices.  Topics covered vary from term to term depending on the priority for learning modules.  Residency at Swanton Pacific and extended field trips required.  8 lectures, 4 activities.  Crosslisted as HNRS/NR 475.",
            "title": "Sustainable Forest and Environmental Practices"
        },
        "HNRS 492": {
            "description": "Addresses the needs of international impoverished communities with techno-logical solutions, which are inexpensive, ecologically sustainable, and socially appropriate.  Group study of target communities, and design and construction of an appropriate technology prototype.  Seminar paper required.  Not open to students with credit in PSC/UNIV/HNRS 392.  3 lectures, 1 laboratory.  Crosslisted as PSC/UNIV 492.",
            "title": "Appropriate Technology for the World's People: Design"
        },
        "HNRS 499": {
            "description": "Students in the Honors Program are required to take at least eight courses for honors credit before graduation. Taking an Honors course may not be possible due to scheduling conflicts or unavailability of courses. This course allows students to engage in honors-level work in a standard, non-honors course on a group basis. Credit/No Credit grading only. Total credit limited to 4 units, repeatable in same term. Must achieve a B or better in the related standard course. 1 seminar.",
            "title": "Honors Group Seminar"
        }
    },
    "links": [
        {
            "source": "MATH 141",
            "target": "HNRS 131",
            "value": 1
        },
        {
            "source": "MATH 142",
            "target": "HNRS 131",
            "value": 1
        },
        {
            "source": "MATH 182",
            "target": "HNRS 131",
            "value": 1
        },
        {
            "source": "PHYS 131",
            "target": "HNRS 132",
            "value": 1
        },
        {
            "source": "HNRS 131",
            "target": "HNRS 132",
            "value": 1
        },
        {
            "source": "PHYS 141",
            "target": "HNRS 132",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "HNRS 134",
            "value": 1
        },
        {
            "source": "MATH 142",
            "target": "HNRS 134",
            "value": 1
        },
        {
            "source": "MATH 182",
            "target": "HNRS 134",
            "value": 1
        },
        {
            "source": "MATH 118",
            "target": "HNRS 141",
            "value": 1
        },
        {
            "source": "MATH 119",
            "target": "HNRS 141",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "HNRS 142",
            "value": 1
        },
        {
            "source": "MATH 142",
            "target": "HNRS 143",
            "value": 1
        },
        {
            "source": "HNRS 161",
            "target": "HNRS 162",
            "value": 1
        },
        {
            "source": "HNRS 162",
            "target": "HNRS 163",
            "value": 1
        },
        {
            "source": "MATH 241",
            "target": "HNRS 211",
            "value": 1
        },
        {
            "source": "PHYS 131",
            "target": "HNRS 211",
            "value": 1
        },
        {
            "source": "PHYS 141",
            "target": "HNRS 211",
            "value": 1
        },
        {
            "source": "MATH 241",
            "target": "HNRS 214",
            "value": 1
        },
        {
            "source": "ME 211",
            "target": "HNRS 214",
            "value": 1
        },
        {
            "source": "ARCE 211",
            "target": "HNRS 214",
            "value": 1
        },
        {
            "source": "MATH 143",
            "target": "HNRS 241",
            "value": 1
        },
        {
            "source": "MATH 143",
            "target": "HNRS 244",
            "value": 1
        },
        {
            "source": "HNRS 261",
            "target": "HNRS 262",
            "value": 1
        },
        {
            "source": "HNRS 262",
            "target": "HNRS 263",
            "value": 1
        },
        {
            "source": "HNRS 162",
            "target": "HNRS 265",
            "value": 1
        },
        {
            "source": "ECON 201",
            "target": "HNRS 303",
            "value": 1
        },
        {
            "source": "ECON 222",
            "target": "HNRS 303",
            "value": 1
        },
        {
            "source": "POLS 112",
            "target": "HNRS 338",
            "value": 1
        },
        {
            "source": "GE D1",
            "target": "HNRS 391",
            "value": 1
        },
        {
            "source": "ENGL 411",
            "target": "HNRS 412",
            "value": 1
        },
        {
            "source": "PHYS 104",
            "target": "HNRS 450",
            "value": 1
        },
        {
            "source": "PHYS 118",
            "target": "HNRS 450",
            "value": 1
        },
        {
            "source": "PHYS 121",
            "target": "HNRS 450",
            "value": 1
        },
        {
            "source": "PHYS 141",
            "target": "HNRS 450",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "HNRS 100"
        },
        {
            "group": 1,
            "id": "HNRS 101"
        },
        {
            "group": 1,
            "id": "HNRS 102"
        },
        {
            "group": 1,
            "id": "HNRS 112"
        },
        {
            "group": 1,
            "id": "HNRS 131"
        },
        {
            "group": 1,
            "id": "HNRS 132"
        },
        {
            "group": 1,
            "id": "HNRS 134"
        },
        {
            "group": 1,
            "id": "HNRS 141"
        },
        {
            "group": 1,
            "id": "HNRS 142"
        },
        {
            "group": 1,
            "id": "HNRS 143"
        },
        {
            "group": 1,
            "id": "HNRS 145"
        },
        {
            "group": 1,
            "id": "HNRS 148"
        },
        {
            "group": 1,
            "id": "HNRS 149"
        },
        {
            "group": 1,
            "id": "HNRS 161"
        },
        {
            "group": 1,
            "id": "HNRS 162"
        },
        {
            "group": 1,
            "id": "HNRS 163"
        },
        {
            "group": 1,
            "id": "HNRS 200"
        },
        {
            "group": 1,
            "id": "HNRS 201"
        },
        {
            "group": 1,
            "id": "HNRS 202"
        },
        {
            "group": 1,
            "id": "HNRS 203"
        },
        {
            "group": 1,
            "id": "HNRS 204"
        },
        {
            "group": 1,
            "id": "HNRS 207"
        },
        {
            "group": 1,
            "id": "HNRS 211"
        },
        {
            "group": 1,
            "id": "HNRS 212"
        },
        {
            "group": 1,
            "id": "HNRS 213"
        },
        {
            "group": 1,
            "id": "HNRS 214"
        },
        {
            "group": 1,
            "id": "HNRS 216"
        },
        {
            "group": 1,
            "id": "HNRS 223"
        },
        {
            "group": 1,
            "id": "HNRS 230"
        },
        {
            "group": 1,
            "id": "HNRS 231"
        },
        {
            "group": 1,
            "id": "HNRS 232"
        },
        {
            "group": 1,
            "id": "HNRS 241"
        },
        {
            "group": 1,
            "id": "HNRS 242"
        },
        {
            "group": 1,
            "id": "HNRS 244"
        },
        {
            "group": 1,
            "id": "HNRS 251"
        },
        {
            "group": 1,
            "id": "HNRS 261"
        },
        {
            "group": 1,
            "id": "HNRS 262"
        },
        {
            "group": 1,
            "id": "HNRS 263"
        },
        {
            "group": 1,
            "id": "HNRS 265"
        },
        {
            "group": 1,
            "id": "HNRS 270"
        },
        {
            "group": 1,
            "id": "HNRS 299"
        },
        {
            "group": 1,
            "id": "HNRS 302"
        },
        {
            "group": 1,
            "id": "HNRS 303"
        },
        {
            "group": 1,
            "id": "HNRS 304"
        },
        {
            "group": 1,
            "id": "HNRS 310"
        },
        {
            "group": 1,
            "id": "HNRS 311"
        },
        {
            "group": 1,
            "id": "HNRS 312"
        },
        {
            "group": 1,
            "id": "HNRS 317"
        },
        {
            "group": 1,
            "id": "HNRS 320"
        },
        {
            "group": 1,
            "id": "HNRS 321"
        },
        {
            "group": 1,
            "id": "HNRS 322"
        },
        {
            "group": 1,
            "id": "HNRS 323"
        },
        {
            "group": 1,
            "id": "HNRS 324"
        },
        {
            "group": 1,
            "id": "HNRS 332"
        },
        {
            "group": 1,
            "id": "HNRS 333"
        },
        {
            "group": 1,
            "id": "HNRS 334"
        },
        {
            "group": 1,
            "id": "HNRS 335"
        },
        {
            "group": 1,
            "id": "HNRS 336"
        },
        {
            "group": 1,
            "id": "HNRS 338"
        },
        {
            "group": 1,
            "id": "HNRS 340"
        },
        {
            "group": 1,
            "id": "HNRS 341"
        },
        {
            "group": 1,
            "id": "HNRS 342"
        },
        {
            "group": 1,
            "id": "HNRS 343"
        },
        {
            "group": 1,
            "id": "HNRS 345"
        },
        {
            "group": 1,
            "id": "HNRS 347"
        },
        {
            "group": 1,
            "id": "HNRS 350"
        },
        {
            "group": 1,
            "id": "HNRS 352"
        },
        {
            "group": 1,
            "id": "HNRS 353"
        },
        {
            "group": 1,
            "id": "HNRS 361"
        },
        {
            "group": 1,
            "id": "HNRS 380"
        },
        {
            "group": 1,
            "id": "HNRS 391"
        },
        {
            "group": 1,
            "id": "HNRS 392"
        },
        {
            "group": 1,
            "id": "HNRS 400"
        },
        {
            "group": 1,
            "id": "HNRS 411"
        },
        {
            "group": 1,
            "id": "HNRS 412"
        },
        {
            "group": 1,
            "id": "HNRS 424"
        },
        {
            "group": 1,
            "id": "HNRS 450"
        },
        {
            "group": 1,
            "id": "HNRS 461"
        },
        {
            "group": 1,
            "id": "HNRS 470"
        },
        {
            "group": 1,
            "id": "HNRS 471"
        },
        {
            "group": 1,
            "id": "HNRS 475"
        },
        {
            "group": 1,
            "id": "HNRS 492"
        },
        {
            "group": 1,
            "id": "HNRS 499"
        },
        {
            "group": 2,
            "id": "MATH 141"
        },
        {
            "group": 2,
            "id": "MATH 142"
        },
        {
            "group": 2,
            "id": "MATH 182"
        },
        {
            "group": 3,
            "id": "PHYS 131"
        },
        {
            "group": 3,
            "id": "PHYS 141"
        },
        {
            "group": 2,
            "id": "MATH 118"
        },
        {
            "group": 2,
            "id": "MATH 119"
        },
        {
            "group": 2,
            "id": "MATH 241"
        },
        {
            "group": 4,
            "id": "ME 211"
        },
        {
            "group": 5,
            "id": "ARCE 211"
        },
        {
            "group": 2,
            "id": "MATH 143"
        },
        {
            "group": 6,
            "id": "ECON 201"
        },
        {
            "group": 6,
            "id": "ECON 222"
        },
        {
            "group": 7,
            "id": "POLS 112"
        },
        {
            "group": 8,
            "id": "GE D1"
        },
        {
            "group": 9,
            "id": "ENGL 411"
        },
        {
            "group": 3,
            "id": "PHYS 104"
        },
        {
            "group": 3,
            "id": "PHYS 118"
        },
        {
            "group": 3,
            "id": "PHYS 121"
        }
    ]
}