{
    "descriptions": {
        "JOUR 102": {
            "description": "Introduction to current practices in American news media with a focus on emerging technologies and traditional print and broadcast operations. Exploration of changing career opportunities in news and public relations. Overview of student media organizations and requirements for academic success in journalism. 1 lecture.",
            "title": "Introduction to Journalism"
        },
        "JOUR 201": {
            "description": "Survey of historical influences in the development of today's journalism. Contributions of women and minorities to American mass media. Rise of technology in the communication industry. 4 lectures.",
            "title": "Journalism History"
        },
        "JOUR 203": {
            "description": "Introduction to the fundamental techniques of reporting and writing news articles from print and online perspectives. Extensive laboratory and field practices in gathering and evaluating information. Writing basic news stories under close supervision. 3 lectures, 1 laboratory.",
            "title": "News Reporting and Writing"
        },
        "JOUR 205": {
            "description": "Survey of the media of agricultural communication. Newspaper farm pages and sections, general and specialized agricultural magazines. Radio and TV farm broadcasts. Digital media sources. Public and private agencies involved in agricultural communication. Role of California minorities in agriculture. Writing on agriculture-related issues. 3 lectures, 1 activity.",
            "title": "Agricultural Communications"
        },
        "JOUR 218": {
            "description": "Overview of the interaction between mass media and individuals in American society. Drawing on theoretical perspectives from mass communication and psychology to explore how individuals develop a coherent understanding of self within a highly mediated world. The power and influence of media messages and practices. Individual responsibility in an information society. 4 lectures. Crosslisted as COMS/JOUR 218. Fulfills GE D4.",
            "title": "Media, Self and Society"
        },
        "JOUR 219": {
            "description": "The role of the mass media in a democratic multicultural society. Portrayal and stereotyping of ethnic minorities by different mass media forms throughout U.S. history. The growing impact of minorities in the United States. Achievement and goals of current American ethnic media, with special attention to Latinos/as and African-Americans. 4 lectures. Fulfills USCP.",
            "title": "Multicultural Society and the Mass Media"
        },
        "JOUR 220": {
            "description": "Development of skills and knowledge to produce live and recorded radio shows for the campus radio station KCPR-FM.  Basic station operations, FCC compliance standards, and basic station management.  Required for KCPR staff.  2 lectures.",
            "title": "Introduction to Radio Broadcasting"
        },
        "JOUR 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "JOUR 285": {
            "description": "Introduction to the social, editorial and technical issues surrounding the web as a form of communication.  Fundamentals of gathering, writing and publishing content for the web that includes using photographs, sound, pictures and video to tell a story.  3 lectures, 1 laboratory.",
            "title": "Introduction to Multimedia Journalism"
        },
        "JOUR 302": {
            "description": "Legal basis for freedom of expression.  Court decisions resolving conflicts between First Amendment and right to fair trial, privacy, reputation.  Source confidentiality, freedom of information, contempt, copyright.  Federal and state laws and regulations affecting mass media reporters, editors, publishers, news directors.  Course may be offered in classroom based or online format.  4 lectures.",
            "title": "Mass Media Law"
        },
        "JOUR 303": {
            "description": "Concepts and technologies associated with bringing video, still images and audio online.  Process of web-based audio and video creation, production and publication, from inception to publishing.  3 lectures, 1 laboratory.",
            "title": "Web Audio and Video"
        },
        "JOUR 304": {
            "description": "Experience leading to advanced skills in reporting and writing stories about contemporary issues, government and courts.  Field and laboratory assignments in beat reporting, public meeting coverage, writing style, investigative techniques, and online journalism research.  3 lectures, 1 laboratory.",
            "title": "Public Affairs Reporting"
        },
        "JOUR 312": {
            "description": "Overview of the history, growth and ongoing development of public relations as an information management function in a multicultural environment.  Public relations practices used in commercial and non-profit sectors, and firsthand application of public relations skills.  4 lectures.",
            "title": "Public Relations"
        },
        "JOUR 320": {
            "description": "Field experience in radio station operations at KCPR-FM, the campus radio station.  Emphasizes support functions such as recording announcements, planning and carrying out promotions, underwriting, events and other station management duties.  Required of students also hosting live or prerecorded on-air programs.  Total credit limited to 8 units.  Open only to students on staff at KCPR-FM.  1 laboratory.",
            "title": "Cal Poly Radio Laboratory"
        },
        "JOUR 331": {
            "description": "Principles of advertising, copy, layout, and production across media platforms, including online, mobile, social, print and broadcast.  Economic, political, and social function of advertising in a free market society.  Advertising ethics.  Social responsibility of advertising in a multicultural environment.  Emerging advertising technologies.  4 lectures.",
            "title": "Contemporary Advertising"
        },
        "JOUR 333": {
            "description": "Beginning broadcast news writing and reporting for radio and television.  Emphasis on developing news judgment and producing radio newscasts.  Introduction to television studio equipment and procedures.  Lab experience includes writing and reporting live on-air for KCPR.  Course may be offered in classroom-based or online format.  3 lectures, 1 laboratory.",
            "title": "Broadcast News"
        },
        "JOUR 334": {
            "description": "Editing for print and online publication.  Using the Associated Press style.  Writing headlines, captions, summaries and other display text.  Repurposing various media content for the web and other formats.  Legal and ethical issues for the editor.  3 lectures, 1 laboratory.",
            "title": "Editing"
        },
        "JOUR 342": {
            "description": "Theory, strategic planning and practice in writing persuasive public relations copy for diverse internal and external audiences.  Emphasis on gathering information, preparing news releases, newsletters and other communications vehicles.  Analysis of various media case studies.  4 lectures.",
            "title": "Public Relations Writing and Editing"
        },
        "JOUR 346": {
            "description": "Develop on-air skills in the performance of voice-overs, stand-ups, hosting and the production of televised public service announcements.  Emphasis on the effective use of audio and non-linear video editing techniques as well as broadcast writing.  3 lectures, 1 laboratory.",
            "title": "Broadcast Announcing and Production"
        },
        "JOUR 348": {
            "description": "Instruction on electronic news gathering (ENG) that includes advanced news writing, field reporting and editing for broadcast.  Emphasis on developing research techniques, interviewing skills, responsible and effective non-linear video editing, compelling use of natural sound and professional on-air delivery.  3 lectures, 1 laboratory.",
            "title": "Electronic News Gathering"
        },
        "JOUR 350": {
            "description": "Introduction to the techniques of finding stories in data sets and presenting them visually via interactive online displays.  Emphasis on adapting emerging tools for digital storytelling.  3 lectures, 1 laboratory.",
            "title": "Data Journalism"
        },
        "JOUR 352": {
            "description": "Reporting lab for the print and digital editions of Mustang News.  Total credit limited to 8 units.  3 lectures, 1 laboratory.",
            "title": "Advanced Newspaper Reporting Practicum"
        },
        "JOUR 353": {
            "description": "Students produce a live 30-minute CPTV newscast per week, or a one-hour KCPR segment that incorporates news, information, talk and entertainment.  Emphasis on news producing, reporting and announcing skills.  Total credit limited to 8 units.  3 lectures, 1 laboratory.",
            "title": "Advanced Broadcast Journalism Practicum"
        },
        "JOUR 390": {
            "description": "Theory and application of visual communication in today's media.  Visual communication's power to inform, educate and persuade.  Production of visual media across digital, broadcast and print platforms.  3 lectures, 1 laboratory.",
            "title": "Visual Communication for the Mass Media"
        },
        "JOUR 400": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 8 units, with a maximum of 4 units per quarter.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "JOUR 401": {
            "description": "Global communications facilities and operations; world transmission of information; survey of world wire services and international print and electronic media.  Analysis of press operations under varying government ideologies, including third world countries.  4 seminars.",
            "title": "Global Communication"
        },
        "JOUR 402": {
            "description": "Current issues revolving around the social responsibility of the mass media.  Role of the public, government, and media in considerations of media accountability.  Professional behavior in media organizations.  4 seminars.",
            "title": "Journalism Ethics"
        },
        "JOUR 403": {
            "description": "Development of fundamentals pertaining to the technical and aesthetic proficiencies used in video communication for public service, public relations, marketing and advertising.  All aspects of pitching, planning, production, editing and post-production in addition to historical and regulatory aspects of communication policy and mandates.  3 lectures, 1 laboratory.",
            "title": "Multimedia Production for Public Relations and Advertising"
        },
        "JOUR 407": {
            "description": "Practice in researching, interviewing and the writing and marketing of both long and short form nonfiction articles for various media outlets.  Analysis of similar work in current distribution.  4 lectures.",
            "title": "Feature Writing"
        },
        "JOUR 410": {
            "description": "Apply the theories and applications of digital journalism to the development and publication of innovative digital content.  3 lectures, 1 laboratory.",
            "title": "Advanced Digital Journalism"
        },
        "JOUR 412": {
            "description": "Apply contemporary public relations theory to turn crisis into opportunity.  Analyze Homeland Security and FEMA best practices using public relations framework and strategy.  Practical exercises in planning, implementing, and evaluating public relations messages in a variety of media platforms.  4 lectures.",
            "title": "Public Relations and Crisis Management"
        },
        "JOUR 413": {
            "description": "Development of skills needed to plan and conduct internal and external public relations campaigns for corporate and non-profit organizations.  Includes goal setting, management of resources, budgeting, creation of campaign communications, and outcomes analysis.  4 lectures.",
            "title": "Public Relations Campaigns"
        },
        "JOUR 415": {
            "description": "Proposing, creating, managing, and implementing public relations campaigns for community-based clients on behalf of the student-run firm, Central Coast PRspectives.  3 lectures, 1 laboratory.",
            "title": "Advanced Public Relations Practice: CCPR"
        },
        "JOUR 418": {
            "description": "Examination of intellectual property rights covered by copyright, trademark and, to a limited degree, patent law as well as commercial speech rights in a digital media age.  Emphasis on intellectual property rights as they affect content creators and other publishers in a digital world.  4 lectures.",
            "title": "Copyright, Trademark, Patent and Commercial Speech in Digital Media"
        },
        "JOUR 444": {
            "description": "Application of techniques on daily basis with media under supervision of department faculty.  Credit/No Credit grading only.",
            "title": "Media Internship"
        },
        "JOUR 460": {
            "description": "Selection and completion of a project under faculty supervision.  Projects typical of problems which graduates must solve in their fields of employment.  Project results are presented in a formal report.  Minimum 90 hours total time.",
            "title": "Senior Project"
        },
        "JOUR 462": {
            "description": "Capstone experience that applies principles and tools of print, broadcast and digital journalism and public relations to tell engaging stories across multiple platforms.  Emphasis on integrating text, video, audio, graphics, search engine optimization and social networking to produce content for digital publication.  3 lectures, 1 laboratory.",
            "title": "Senior Media Practicum"
        },
        "JOUR 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list topic selected.  Total credit limited to 8 units.  2-4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "JOUR 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  The Schedule of Classes will list topic selected.  Total credit limited to 8 units.  1-4 laboratories.",
            "title": "Selected Advanced Laboratory"
        }
    },
    "links": [
        {
            "source": "JOUR 203",
            "target": "JOUR 285",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 302",
            "value": 1
        },
        {
            "source": "JOUR 285",
            "target": "JOUR 303",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 304",
            "value": 1
        },
        {
            "source": "JOUR 220",
            "target": "JOUR 320",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 334",
            "value": 1
        },
        {
            "source": "JOUR 312",
            "target": "JOUR 342",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 346",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 348",
            "value": 1
        },
        {
            "source": "JOUR 333",
            "target": "JOUR 348",
            "value": 1
        },
        {
            "source": "JOUR 285",
            "target": "JOUR 350",
            "value": 1
        },
        {
            "source": "STAT 130",
            "target": "JOUR 350",
            "value": 1
        },
        {
            "source": "STAT 217",
            "target": "JOUR 350",
            "value": 1
        },
        {
            "source": "STAT 218",
            "target": "JOUR 350",
            "value": 1
        },
        {
            "source": "STAT 251",
            "target": "JOUR 350",
            "value": 1
        },
        {
            "source": "JOUR 304",
            "target": "JOUR 352",
            "value": 1
        },
        {
            "source": "JOUR 334",
            "target": "JOUR 352",
            "value": 1
        },
        {
            "source": "JOUR 233",
            "target": "JOUR 352",
            "value": 1
        },
        {
            "source": "JOUR 333",
            "target": "JOUR 353",
            "value": 1
        },
        {
            "source": "JOUR 346",
            "target": "JOUR 353",
            "value": 1
        },
        {
            "source": "JOUR 348",
            "target": "JOUR 353",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 390",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 401",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 402",
            "value": 1
        },
        {
            "source": "JOUR 303",
            "target": "JOUR 403",
            "value": 1
        },
        {
            "source": "JOUR 348",
            "target": "JOUR 403",
            "value": 1
        },
        {
            "source": "JOUR 203",
            "target": "JOUR 407",
            "value": 1
        },
        {
            "source": "JOUR 285",
            "target": "JOUR 410",
            "value": 1
        },
        {
            "source": "JOUR 312",
            "target": "JOUR 413",
            "value": 1
        },
        {
            "source": "JOUR 342",
            "target": "JOUR 413",
            "value": 1
        },
        {
            "source": "BUS 453",
            "target": "JOUR 415",
            "value": 1
        },
        {
            "source": "JOUR 413",
            "target": "JOUR 415",
            "value": 1
        },
        {
            "source": "JOUR 352",
            "target": "JOUR 444",
            "value": 1
        },
        {
            "source": "JOUR 353",
            "target": "JOUR 444",
            "value": 1
        },
        {
            "source": "JOUR 413",
            "target": "JOUR 444",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "JOUR 102"
        },
        {
            "group": 1,
            "id": "JOUR 201"
        },
        {
            "group": 1,
            "id": "JOUR 203"
        },
        {
            "group": 1,
            "id": "JOUR 205"
        },
        {
            "group": 1,
            "id": "JOUR 218"
        },
        {
            "group": 1,
            "id": "JOUR 219"
        },
        {
            "group": 1,
            "id": "JOUR 220"
        },
        {
            "group": 1,
            "id": "JOUR 270"
        },
        {
            "group": 1,
            "id": "JOUR 285"
        },
        {
            "group": 1,
            "id": "JOUR 302"
        },
        {
            "group": 1,
            "id": "JOUR 303"
        },
        {
            "group": 1,
            "id": "JOUR 304"
        },
        {
            "group": 1,
            "id": "JOUR 312"
        },
        {
            "group": 1,
            "id": "JOUR 320"
        },
        {
            "group": 1,
            "id": "JOUR 331"
        },
        {
            "group": 1,
            "id": "JOUR 333"
        },
        {
            "group": 1,
            "id": "JOUR 334"
        },
        {
            "group": 1,
            "id": "JOUR 342"
        },
        {
            "group": 1,
            "id": "JOUR 346"
        },
        {
            "group": 1,
            "id": "JOUR 348"
        },
        {
            "group": 1,
            "id": "JOUR 350"
        },
        {
            "group": 1,
            "id": "JOUR 352"
        },
        {
            "group": 1,
            "id": "JOUR 353"
        },
        {
            "group": 1,
            "id": "JOUR 390"
        },
        {
            "group": 1,
            "id": "JOUR 400"
        },
        {
            "group": 1,
            "id": "JOUR 401"
        },
        {
            "group": 1,
            "id": "JOUR 402"
        },
        {
            "group": 1,
            "id": "JOUR 403"
        },
        {
            "group": 1,
            "id": "JOUR 407"
        },
        {
            "group": 1,
            "id": "JOUR 410"
        },
        {
            "group": 1,
            "id": "JOUR 412"
        },
        {
            "group": 1,
            "id": "JOUR 413"
        },
        {
            "group": 1,
            "id": "JOUR 415"
        },
        {
            "group": 1,
            "id": "JOUR 418"
        },
        {
            "group": 1,
            "id": "JOUR 444"
        },
        {
            "group": 1,
            "id": "JOUR 460"
        },
        {
            "group": 1,
            "id": "JOUR 462"
        },
        {
            "group": 1,
            "id": "JOUR 470"
        },
        {
            "group": 1,
            "id": "JOUR 471"
        },
        {
            "group": 2,
            "id": "STAT 130"
        },
        {
            "group": 2,
            "id": "STAT 217"
        },
        {
            "group": 2,
            "id": "STAT 218"
        },
        {
            "group": 2,
            "id": "STAT 251"
        },
        {
            "group": 1,
            "id": "JOUR 233"
        },
        {
            "group": 3,
            "id": "BUS 453"
        }
    ]
}