{
    "descriptions": {
        "LA 101": {
            "description": "Introduction to the profession of landscape architecture and orientation to the department curriculum and learning processes. 4 lectures.",
            "title": "Introduction to Landscape Architecture"
        },
        "LA 170": {
            "description": "Overview of design communications for landscape architects incorporating the principles, techniques, skills and tools used in design generation, exploration, review and implementation. 4 laboratories.",
            "title": "Principles of Design Communication"
        },
        "LA 171": {
            "description": "Introduction of digital media applications, software and techniques for landscape architects. Principles, techniques, skills and tools for using digital media in design projects. 4 lectures.",
            "title": "Principles of Digital Communication"
        },
        "LA 202": {
            "description": "Introduction to the principles, methods and elements of two- and three-dimensional design in order to communicate intended concepts and meanings.  Exploration of the basic design elements including composition, design process and the creation of spatial settings.  4 laboratories.",
            "title": "Design Fundamentals I"
        },
        "LA 203": {
            "description": "Continuation of ideas introduced in LA 202 with the introduction of environmental and visual perception, including three-dimensional site design and landscape architectural design principles.  Spatial design and sequencing of space with concern for human behavioral, environmental and natural site factors and generation of program, concept and design development.  4 laboratories.",
            "title": "Design Fundamentals II"
        },
        "LA 204": {
            "description": "Continuation of ideas introduced in LA 202 and LA 203 with the introduction of the principles of design theory, landscape ecology and technical applications.  Problems of increasing complexity incorporate critical and creative problem solving, the relationship of aesthetics, response to human needs and design for sustainable environments.  4 laboratories.",
            "title": "Design Fundamentals III"
        },
        "LA 211": {
            "description": "Exploration of the continuous alteration of the landscape through recorded time and examination of how humankind has influenced this change. The metaphor of 'garden' provides understanding for agrarian regions, urban spaces, and vernacular landscapes of the world. 4 lectures. Fulfills GE C3.",
            "title": "History of Landscape Architecture: Ancient Civilizations through Colonial America"
        },
        "LA 212": {
            "description": "Philosophies and ethics of important personalities in twentieth and twenty-first century landscape architecture. Design theories supporting these individuals' projects and the nature of their practice, combined with the influential events in industry, the arts and sciences, politics, and society of these centuries. 4 lectures. Fulfills GE C3.",
            "title": "History of Modern and Contemporary Landscape Architecture"
        },
        "LA 218": {
            "description": "ARC/INFO and ArcView Geographic Information System (GIS) computer software to explore environmental, natural resource, social and economic issues using spatial data. Develop and apply data base and software management competencies. 1 lecture, 2 laboratories. Crosslisted as LA/NR 218.",
            "title": "Applications in GIS"
        },
        "LA 220": {
            "description": "Concepts, theories and techniques related to landscape analysis, ecology, planning and design with an emphasis on landscape assessment, sustainability, land health, environmental protection and restoration, and natural resource management. 4 lectures. Fulfills GE B5.",
            "title": "Landscape Ecology: Concepts, Issues and Interrelationships"
        },
        "LA 221": {
            "description": "Introduction to the horticultural characteristics and landscape design potential of California native plants, California plant communities and associated vernacular plants.  Includes experience in field identification, basic planting design, installation techniques and maintenance requirements.  Required field trips.  2 lectures, 2 laboratories.",
            "title": "California Plants and Plant Communities"
        },
        "LA 241": {
            "description": "Introduction and application of the techniques, methods, principles and criteria for site engineering and landform design.  Includes an introduction to soil science, survey methods, and experiences in the principles, procedures and application of site grading and drainage for landscape architecture.  4 laboratories.",
            "title": "Site Engineering Techniques and Applications"
        },
        "LA 242": {
            "description": "Introduction and application of the methods, principles and criteria for landscape implementation.  Encompasses fundamental design and technical decisions common to landscape architectural design and construction projects including the development of concept, design development and working drawings, and construction management process.  3 lectures, 1 activity.",
            "title": "Implementation Strategies"
        },
        "LA 243": {
            "description": "Introduction to the properties, uses and inherent qualities of the fundamental materials of landscape architectural concerns and associated construction techniques and processes.  Materials and techniques explored as a source of design ideas, form and expression in landscape architecture.  3 lectures, 1 activity.",
            "title": "Materials and Techniques of Landscape Construction"
        },
        "LA 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "LA 317": {
            "description": "Basic foundation for understanding the world through geographic information and tools available to utilize spatial data.  Application of Geographic Information Systems (GIS) and related technologies, including their scientific basis of operation.  Not open to students with credit in LA/NR 218.  3 lectures, 1 activity.  Crosslisted as LA/NR 317.  Fulfills GE Area F.",
            "title": "The World of Spatial Data and Geographic Information Technology"
        },
        "LA 320": {
            "description": "Complements the material and knowledge presented in the history of landscape architecture, architecture and art courses.  Design theory and associated concepts as they are related to landscape architecture.  Literature research and analysis of completed design projects.  The artists/designers, materials and overall expressions of work are related to the social and economic issues of the time as well as their associations with the other arts and sciences.  4 lectures.",
            "title": "Design Theory for Landscape Architects"
        },
        "LA 330": {
            "description": "Investigation of the complexities and interrelatedness of culture, environment and ethical decisions.  Interpretation of personal and cultural values and ethics in terms of decisions made and behaviors and actions expressed in the built landscape.  4 lectures.",
            "title": "Cultural Landscapes: People, Places and Ethical Decisions"
        },
        "LA 349": {
            "description": "Advanced examination of the theories and applied principles of planting design.  Emphasis on connections between art and science in the design of parks, gardens and other landscapes.  Case studies and field trips.  2 lectures, 2 activities.",
            "title": "Advanced Planting Design"
        },
        "LA 350": {
            "description": "Examination and application of advanced landscape construction techniques.  Emphasis on design, development, construction, and testing of contemporary landscape technologies and practices.  Field trip may be required.  2 lectures, 2 laboratories.",
            "title": "Advanced Landscape Construction"
        },
        "LA 370": {
            "description": "Issues related to the practice of landscape architecture incorporating processes, procedures and outcomes of professional practice.  Topics include professional ethics, business and legal aspects of the profession, relationships to the client and society, personal goal setting, resume and portfolio preparation.  4 lectures.",
            "title": "Professional Practice"
        },
        "LA 371": {
            "description": "Involvement in a work setting related to landscape architecture.  Thirty hours work experience per unit of credit.  Credit/No Credit grading only.",
            "title": "Internship"
        },
        "LA 400": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 8 units, with a maximum of 4 units per quarter.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "LA 401": {
            "description": "Research methods in landscape architecture and proposal writing techniques.  Students prepare proposal and strategy for fifth year study in area of concentration.  2 seminars.",
            "title": "Research Project"
        },
        "LA 402": {
            "description": "Exploration and application of design theory, exploratory design process and form exploration to design and planning projects.  Emphasis on incorporation of inquiry techniques based on the synthesis of interdisciplinary frameworks of art and design theory with historical and cultural issues.  Total credit limited to 12 units.  4 laboratories.",
            "title": "Design Theory and Exploration Focus Studio"
        },
        "LA 403": {
            "description": "Assessment, exploration and integration of landscape ecology, sustainability and environmental planning to design and planning projects.  Emphasis on interpretation and application of environmental and ecological issues at a range of design scales.  Total credit limited to 12 units.  4 laboratories.",
            "title": "Natural Environments Design Focus Studio"
        },
        "LA 404": {
            "description": "Assessment, exploration and interpretation of cultural values, issues and landscapes to design and planning projects.  Emphasis on observation and inquiry of diverse cultural settings, differences in cultural values and personal ethics in the design process.  Total credit limited to 12 units.  4 laboratories.",
            "title": "Cultural Environments Design Focus Studio"
        },
        "LA 405": {
            "description": "Development, exploration and integration of project design and implementation strategies to design and planning projects.  Emphasis on creative and exploratory problem solving, spatial design, project resolution, and graphic communication.  Total credit limited to 12 units.  4 laboratories.",
            "title": "Project Design and Implementation Focus Studio"
        },
        "LA 406": {
            "description": "Design studio with focus on interdisciplinary modes of practice and collaborative approaches to design.  Interdisciplinary design process may be explored through project program and collaboration with students in allied majors.  Field trip required.  Total credit limited to 12 units.  4 laboratories.",
            "title": "Interdisciplinary Design Studio"
        },
        "LA 431": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of computer-aided drafting (CAD) skills in coursework, project planning and design studio courses.  Focus on CAD skills and integration of digital media.  Total credit limited to 12 units.  4 activities.",
            "title": "CAD and Digital Media Communications (ILC)"
        },
        "LA 432": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of landscape ecology principles in project planning and design studio courses.  Focus on understanding and developing a framework for ecological planning and design to anticipate consequences of planning and design decisions.  Total credit limited to 12 units.  4 activities.",
            "title": "Landscape Ecology Applications (ILC)"
        },
        "LA 433": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of culture, environment and personal ethics in coursework, project planning and design studio courses.  Focus on skills, distinctions and integration of analyzing the cultural landscape, understanding diverse cultural values and assessing personal ethics.  Total credit limited to 12 units.  4 activities.",
            "title": "Cultural Environments (ILC)"
        },
        "LA 434": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of project design principles and implementation strategies in project planning and design studio courses.  Focus on skills, techniques and decisions of the design, documentation and construction processes.  Total credit limited to 12 units.  4 activities.",
            "title": "Project Design and Implementation (ILC)"
        },
        "LA 435": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of professional practice principles and techniques in planning and design studio and internship courses.  Focus on achieving a high level of professional quality, ethical concern, and legal responsibility in project work.  Total credit limited to 12 units.  4 activities.",
            "title": "Professional Practice (ILC)"
        },
        "LA 436": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of graphic communication and presentation skills in coursework, project planning and design studio courses.  Focus on skills, distinctions and integration of traditional and digital media explorations.  Total credit limited to 12 units.  4 activities.",
            "title": "Traditional and Digital Media Communications (ILC)"
        },
        "LA 437": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of 3D digital graphic communication and presentation skills in coursework, project planning and design studio courses.  Focus on skills and integration of three-dimensional digital media explorations.  Total credit limited to 12 units.  4 activities.",
            "title": "3D Digital Design Communications (ILC)"
        },
        "LA 438": {
            "description": "Integrated Learning Course (ILC) to assist integration and application of geographic information systems (GIS) and spatial information into focus design studio courses.  Total credit limited to 12 units.  4 activities.",
            "title": "GIS Application to Design Projects (ILC)"
        },
        "LA 439": {
            "description": "Integrated Learning Course (ILC) to assist the integration and application of plant selection, use and appropriateness in planning and design studio courses.  Focus is on the skills, theories and principles of planting design.  Total credit limited to 12 units.  4 activities.",
            "title": "Planting Design (ILC)"
        },
        "LA 461": {
            "description": "Comprehensive landscape architectural design and research project showing professional level competency in the integration of design theory, landscape architectural principles and project resolution.  Emphasis on creative resolutions, organization and communication skills and technical abilities in program generation, design process, design and research.  Total credit limited to 8 units.  4 laboratories.",
            "title": "Senior Design Project Focus Studio"
        },
        "LA 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  Class Schedule will list topic selected.  Total credit limited to 8 units.  1-4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "LA 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  Class Schedule will list topic selected.  Total credit limited to 8 units.  1-4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "LA 482": {
            "description": "User oriented approach to open space design.  Interview and survey techniques, behavioral trace mapping and systematic observation, post occupancy evaluation and similar methods are used to generate user input and feedback in the design process.  Understanding the behavioral implications of designed environments.  2 lectures, 2 activities.",
            "title": "Evaluating Social and Behavioral Factors for Open Space Design"
        },
        "LA 483": {
            "description": "Special issues and problems through research, field trips, seminars and other forms of investigation and involvement.  Course requirements are determined prior to each individual project through a contractual agreement between students and department.  Departmental Off Campus Study Program guidelines apply.  Total credit limited to 36 units.  1-12 activities.",
            "title": "Special Studies in Landscape Architecture"
        },
        "LA 485": {
            "description": "Part-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  Formal report and evaluation by work supervisor required.  Major credit limited to 6 units; total credit limited to 18 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "LA 495": {
            "description": "Full-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  Formal report and evaluation by work supervisor required.  Major credit limited to 12 units; total credit limited to 24 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "LA 585": {
            "description": "Advanced study analysis and part-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  Total credit limited to 9 units.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        },
        "LA 595": {
            "description": "Advanced study analysis and full-time work experience in student's career field; current innovations, practices, and problems in administration, supervision, and organization of business, industry, and government.  Must have demonstrated ability to do independent work and research in career field.  Credit/No Credit grading only.",
            "title": "Cooperative Education Experience"
        }
    },
    "links": [
        {
            "source": "LA 202",
            "target": "LA 203",
            "value": 1
        },
        {
            "source": "LA 243",
            "target": "LA 203",
            "value": 1
        },
        {
            "source": "LA 203",
            "target": "LA 204",
            "value": 1
        },
        {
            "source": "LA 241",
            "target": "LA 204",
            "value": 1
        },
        {
            "source": "BIO 114",
            "target": "LA 221",
            "value": 1
        },
        {
            "source": "BOT 121",
            "target": "LA 221",
            "value": 1
        },
        {
            "source": "LA 202",
            "target": "LA 241",
            "value": 1
        },
        {
            "source": "LA 243",
            "target": "LA 241",
            "value": 1
        },
        {
            "source": "LA 203",
            "target": "LA 242",
            "value": 1
        },
        {
            "source": "LA 241",
            "target": "LA 242",
            "value": 1
        },
        {
            "source": "LA 211",
            "target": "LA 320",
            "value": 1
        },
        {
            "source": "LA 212",
            "target": "LA 320",
            "value": 1
        },
        {
            "source": "LA 211",
            "target": "LA 330",
            "value": 1
        },
        {
            "source": "LA 212",
            "target": "LA 330",
            "value": 1
        },
        {
            "source": "AEPS 233",
            "target": "LA 349",
            "value": 1
        },
        {
            "source": "AEPS 234",
            "target": "LA 349",
            "value": 1
        },
        {
            "source": "AEPS 381",
            "target": "LA 349",
            "value": 1
        },
        {
            "source": "LA 221",
            "target": "LA 349",
            "value": 1
        },
        {
            "source": "LA 242",
            "target": "LA 350",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 370",
            "value": 1
        },
        {
            "source": "LA 402",
            "target": "LA 401",
            "value": 1
        },
        {
            "source": "LA 405",
            "target": "LA 401",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 402",
            "value": 1
        },
        {
            "source": "LA 211",
            "target": "LA 402",
            "value": 1
        },
        {
            "source": "LA 212",
            "target": "LA 402",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 403",
            "value": 1
        },
        {
            "source": "LA 211",
            "target": "LA 403",
            "value": 1
        },
        {
            "source": "LA 212",
            "target": "LA 403",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 404",
            "value": 1
        },
        {
            "source": "LA 211",
            "target": "LA 404",
            "value": 1
        },
        {
            "source": "LA 212",
            "target": "LA 404",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 405",
            "value": 1
        },
        {
            "source": "LA 243",
            "target": "LA 405",
            "value": 1
        },
        {
            "source": "LA 242",
            "target": "LA 405",
            "value": 1
        },
        {
            "source": "LA 241",
            "target": "LA 405",
            "value": 1
        },
        {
            "source": "LA 402",
            "target": "LA 406",
            "value": 1
        },
        {
            "source": "LA 405",
            "target": "LA 406",
            "value": 1
        },
        {
            "source": "LA 170",
            "target": "LA 431",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 431",
            "value": 1
        },
        {
            "source": "LA 211",
            "target": "LA 433",
            "value": 1
        },
        {
            "source": "LA 241",
            "target": "LA 434",
            "value": 1
        },
        {
            "source": "LA 242",
            "target": "LA 434",
            "value": 1
        },
        {
            "source": "LA 243",
            "target": "LA 434",
            "value": 1
        },
        {
            "source": "LA 170",
            "target": "LA 436",
            "value": 1
        },
        {
            "source": "LA 202",
            "target": "LA 436",
            "value": 1
        },
        {
            "source": "LA 203",
            "target": "LA 436",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 436",
            "value": 1
        },
        {
            "source": "LA 170",
            "target": "LA 437",
            "value": 1
        },
        {
            "source": "LA 204",
            "target": "LA 437",
            "value": 1
        },
        {
            "source": "LA 221",
            "target": "LA 439",
            "value": 1
        },
        {
            "source": "LA 402",
            "target": "LA 461",
            "value": 1
        },
        {
            "source": "LA 405",
            "target": "LA 461",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "LA 101"
        },
        {
            "group": 1,
            "id": "LA 170"
        },
        {
            "group": 1,
            "id": "LA 171"
        },
        {
            "group": 1,
            "id": "LA 202"
        },
        {
            "group": 1,
            "id": "LA 203"
        },
        {
            "group": 1,
            "id": "LA 204"
        },
        {
            "group": 1,
            "id": "LA 211"
        },
        {
            "group": 1,
            "id": "LA 212"
        },
        {
            "group": 1,
            "id": "LA 218"
        },
        {
            "group": 1,
            "id": "LA 220"
        },
        {
            "group": 1,
            "id": "LA 221"
        },
        {
            "group": 1,
            "id": "LA 241"
        },
        {
            "group": 1,
            "id": "LA 242"
        },
        {
            "group": 1,
            "id": "LA 243"
        },
        {
            "group": 1,
            "id": "LA 270"
        },
        {
            "group": 1,
            "id": "LA 317"
        },
        {
            "group": 1,
            "id": "LA 320"
        },
        {
            "group": 1,
            "id": "LA 330"
        },
        {
            "group": 1,
            "id": "LA 349"
        },
        {
            "group": 1,
            "id": "LA 350"
        },
        {
            "group": 1,
            "id": "LA 370"
        },
        {
            "group": 1,
            "id": "LA 371"
        },
        {
            "group": 1,
            "id": "LA 400"
        },
        {
            "group": 1,
            "id": "LA 401"
        },
        {
            "group": 1,
            "id": "LA 402"
        },
        {
            "group": 1,
            "id": "LA 403"
        },
        {
            "group": 1,
            "id": "LA 404"
        },
        {
            "group": 1,
            "id": "LA 405"
        },
        {
            "group": 1,
            "id": "LA 406"
        },
        {
            "group": 1,
            "id": "LA 431"
        },
        {
            "group": 1,
            "id": "LA 432"
        },
        {
            "group": 1,
            "id": "LA 433"
        },
        {
            "group": 1,
            "id": "LA 434"
        },
        {
            "group": 1,
            "id": "LA 435"
        },
        {
            "group": 1,
            "id": "LA 436"
        },
        {
            "group": 1,
            "id": "LA 437"
        },
        {
            "group": 1,
            "id": "LA 438"
        },
        {
            "group": 1,
            "id": "LA 439"
        },
        {
            "group": 1,
            "id": "LA 461"
        },
        {
            "group": 1,
            "id": "LA 470"
        },
        {
            "group": 1,
            "id": "LA 471"
        },
        {
            "group": 1,
            "id": "LA 482"
        },
        {
            "group": 1,
            "id": "LA 483"
        },
        {
            "group": 1,
            "id": "LA 485"
        },
        {
            "group": 1,
            "id": "LA 495"
        },
        {
            "group": 1,
            "id": "LA 585"
        },
        {
            "group": 1,
            "id": "LA 595"
        },
        {
            "group": 2,
            "id": "BIO 114"
        },
        {
            "group": 3,
            "id": "BOT 121"
        },
        {
            "group": 4,
            "id": "AEPS 233"
        },
        {
            "group": 4,
            "id": "AEPS 234"
        },
        {
            "group": 4,
            "id": "AEPS 381"
        }
    ]
}