{
    "descriptions": {
        "MATE 110": {
            "description": "Laboratory work in teams to design, build and test a product.  Material from math, science and engineering courses tied together.  1 laboratory.",
            "title": "Introduction to Materials Engineering Design  I"
        },
        "MATE 120": {
            "description": "Second design laboratory, working in teams to design, build and test a complex system that benefits humanity.  Focus on complete design process including project management, documentation in design, manufacturing techniques, and analysis of testing data.  Issues of engineering ethics, technology and society, the environment and sustainability also studied.  1 laboratory.",
            "title": "Introduction to Materials Engineering Design II"
        },
        "MATE 130": {
            "description": "Third design laboratory in a sequence.  Includes working in teams on project that benefits humanity.  Issues of engineering ethics, technology and society, the environment and sustainability.  1 laboratory.",
            "title": "Introduction to Materials Engineering Design III"
        },
        "MATE 200": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 8 units, with a maximum of 4 units per quarter.",
            "title": "Special Problems for Undergraduates"
        },
        "MATE 210": {
            "description": "Structure of matter.  Physical and mechanical properties of materials including metals, polymers, ceramics, composites, and electronic materials.  Equilibrium diagrams.  Heat treatments, materials selection and corrosion phenomena.  3 lectures.",
            "title": "Materials Engineering"
        },
        "MATE 215": {
            "description": "Focus on processing-structure-properties relationships of materials, including crystal structures, electronic properties of materials, materials selection, phase diagrams, corrosion, mechanical properties of polymers, cold work and annealing of alloys and heat treatments of steels.  1 laboratory.",
            "title": "Materials Laboratory I"
        },
        "MATE 222": {
            "description": "Materials selection for sustainable product design.  Use of material selection software and techniques to solve design problems with multiple objectives and constraints.  Focus on Triple Bottom Line design including functionality, economic viability, and sustainability.  Principles and tools for weighted property optimization, production cost modeling, and life cycle analysis introduced through project-based learning mode.  4 lectures.",
            "title": "Materials Selection Life Cycle"
        },
        "MATE 225": {
            "description": "Process-structure relationships of materials.  Introduction to materials characterization techniques including differential scanning calorimetry, x-ray diffraction, and metallography.  Emphasis on materials engineering professional practices and written communication.  1 laboratory.",
            "title": "Materials Laboratory II"
        },
        "MATE 232": {
            "description": "Materials Engineering principles through the context of historical and current events.  Ethics and systems thinking are integrated in the study of the impacts of materials and technology on society during the Stone Age, Bronze Age, and Iron Ages, as well as today's world.  Topics include crystallography, phase diagrams, microstructures, processing techniques, and nanotechnology.  4 lectures.",
            "title": "Materials, Ethics, and Society"
        },
        "MATE 235": {
            "description": "Mechanical property testing by tensile tests and hardness tests.  Emphasis of data interpretation and analysis with structure-property relationships of materials.  Continued materials engineering professional practices.  1 laboratory.",
            "title": "Materials Laboratory III"
        },
        "MATE 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "MATE 310": {
            "description": "Design and synthesis of noncrystalline material systems.  Synthesis, processing techniques, properties and fabrication methods of organic and inorganic polymeric materials.  3 lectures, 1 laboratory.",
            "title": "Noncrystalline Material Systems"
        },
        "MATE 325": {
            "description": "Directed group laboratory study of energy transport.  Focus on conduction and convection.  1 laboratory.",
            "title": "Transport Phenomena I"
        },
        "MATE 326": {
            "description": "Directed group laboratory study of fluid static and dynamic properties and behavior.  Focus on non-compressible conditions.  1 laboratory.",
            "title": "Transport Phenomena II"
        },
        "MATE 327": {
            "description": "Introduction to radiative heat transfer and the material properties that control it.  1 laboratory.",
            "title": "Transport Phenomena III"
        },
        "MATE 330": {
            "description": "Properties, design and applications of composite material systems, concentrating on polymer-matrix, ceramic-fiber composites.  Materials (matrices, fibers), mechanical behavior and properties, and manufacturing methods treated in detail.  Laboratory practice concentrates on the mechanical testing of fiber-reinforced composite materials.  3 lectures, 1 laboratory.",
            "title": "Composite Materials Systems"
        },
        "MATE 340": {
            "description": "Design of electronic materials systems utilizing the basic concepts in electron theory of solids, electrical properties and conduction in materials, magnetic phenomena and optical properties in materials.  3 lectures, 1 laboratory.",
            "title": "Electronic Materials Systems"
        },
        "MATE 350": {
            "description": "Design of structural materials systems.  Topics include stress, strain, elasticity, anelasticity, plasticity, fracture and fatigue.  3 lectures, 1 laboratory.",
            "title": "Structural Materials Systems"
        },
        "MATE 359": {
            "description": "Evolution of materials (ceramics, metals, polymers, composites, semiconductors) in the context of history.  Traces the link between historical and technological developments enabled by materials from the Stone Age to the Electronic Age.  4 lectures.  Crosslisted as HIST/MATE 359.  Fulfills GE Area F.",
            "title": "Living in a Material World"
        },
        "MATE 360": {
            "description": "Physical metallurgy of engineering alloys including ferrous (steel) and nonferrous (aluminum, copper) systems.  Connection to phase diagrams, microstructural development and phase transformations, physical and mechanical properties, precipitation hardening, cold work and annealing treated in detail.  Laboratory focuses on microstructure development in steels and aluminum alloy casting.  3 lectures, 1 laboratory.",
            "title": "Metallurgical Materials Systems"
        },
        "MATE 370": {
            "description": "Design of processes for engineering materials.  Topics include kinetics in materials:  solid-state diffusion (steady-state and non-steady-state), nucleation and growth kinetics, solid state phase transformations.  3 lectures, 1 laboratory.",
            "title": "Kinetics of Materials and Process Design"
        },
        "MATE 380": {
            "description": "Thermodynamics concepts related to materials engineering systems and processes:  process flowsheets, mass and energy balances, Ellingham diagrams.  Physical chemistry concepts related to materials engineering:  ideal gases, systems and surroundings, first through third laws of thermodynamics, phase equilibria, chemical reactions.  4 lectures.",
            "title": "Thermodynamics and Physical Chemistry"
        },
        "MATE 400": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 8 units, with a maximum of 4 units per quarter.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "MATE 401": {
            "description": "Hands-on experience with materials characterization instruments, such as scanning electron microscopy (SEM), light optical microscopy, x-ray diffraction (XRD), and atomic force microscopy (AFM).  Open-ended projects to develop expertise with trouble-shooting ability, and the process of materials characterization and analysis 2 lectures, 2 laboratories.",
            "title": "Materials Characterization Techniques"
        },
        "MATE 410": {
            "description": "Material properties (mechanics, electronics, heat transfer, photonics, fluid mechanics and biomechanics) at the nanometer scale.  Evaluation of nano-scale systems designed from a bottoms-up approach with unique properties.  Exploration of integration of biology, chemistry, physics and engineering.  3 lectures.",
            "title": "Nanoscale Engineering"
        },
        "MATE 420": {
            "description": "Exploration of the synthesis, processing, properties, and performance of biologically derived polymers.  Examination of nano-scale reinforcements and their use to enhance performance of biopolymers.  Emphasis on reading and interpreting contemporary scientific literature.  4 lectures.",
            "title": "Biopolymers and Bionanocomposites"
        },
        "MATE 425": {
            "description": "Forms of corrosion.  Influences of environmental variables on corrosion.  Methods of corrosion control.  3 lectures, 1 laboratory.",
            "title": "Corrosion Engineering"
        },
        "MATE 430": {
            "description": "Fabrication science and technology for creating micro and nano scale devices.  Explore basic processes such as oxidation, diffusion, ion implantation, etching, chemical and physical vapor deposition, photolithography.  Develop an understanding of the science of each process and how to select the right steps for fabricating electronic, photon and micro-electro-mechanical systems devices.  3 lectures.  Crosslisted as BMED 434/EE 423/MATE 430.",
            "title": "Micro/Nano Fabrication"
        },
        "MATE 435": {
            "description": "Application of basic processes involved in microfabrication:  cleanroom protocol, oxidation, diffusion, photolithography etching and sputtering.  Explore process development through fabrication of electronic, photonic or microfluidic devices.  Each student will be part of a team that will fabricate and test a device.  1 laboratory.  Crosslisted as BMED/MATE 435.",
            "title": "Microfabrication Laboratory"
        },
        "MATE 440": {
            "description": "Principles, primary variables, and microstructural changes associated with the joining process.  Physics of energy transfer.  Heat and mass balances in joining, thermodynamic and kinetic justification of solidification and near interface microstructures.  Heterogeneous interfaces, adhesion, wetting.  Relation between process selection, interface design, microstructure, and properties, weldability.  3 lectures.",
            "title": "Welding Metallurgy and Joining of Advanced Materials"
        },
        "MATE 445": {
            "description": "Laboratory to accompany MATE 440.  Illustration of principles, primary variables, and microstructural changes associated with the joining process.  Physics of energy transfer.  Heat and mass balances in joining, thermodynamic and kinetic justification of solidification and near interface micro-structures.  Heterogeneous interfaces, adhesion, wetting.  Relation between process selection, interface design, microstructure, and properties, weldability.  2 laboratories.",
            "title": "Joining of Advanced Materials Laboratory"
        },
        "MATE 446": {
            "description": "Surface energy.  Capillarity, solid and liquid interface, adsorption.  Surface areas of solids.  Contact angles and wetting.  Friction, lubrication and adhesion.  Relationship of surface to bulk properties of materials.  Applications.  3 lectures.  Crosslisted as CHEM/MATE 446.",
            "title": "Surface Chemistry of Materials"
        },
        "MATE 450": {
            "description": "Fracture processes and fracture mechanics of structural materials concentrating on engineering alloys.  Topics include fracture of alloys, fracture mechanics (Griffith analysis, Linear Elastic Fracture Mechanics), and fatigue.  Laboratory focuses on fracture surface analysis, failure analysis, and mechanical testing.  3 lectures, 1 laboratory.",
            "title": "Fracture and Failure Analysis"
        },
        "MATE 458": {
            "description": "Materials, processes, and reliability of microelectronics and electronics packaging, surface mount assembly and printed circuit board fabrication.  Organic substrates and ceramic substrates.  Mechanical design, thermal, and electrical considerations in electronic packaging.  Design for manufacturability.  Overview of optoelectronics packaging and other emerging technologies in microelectronics and electronic packaging.  Project on design and manufacture of an electronic device.  3 lectures, 1 laboratory.  Crosslisted as CPE 488/IME 458/MATE 458.",
            "title": "Microelectronics and Electronics Packaging"
        },
        "MATE 460": {
            "description": "Materials-based approach to mechanical design.  Using mechanical and physical properties of materials (performance indices) to select structural materials for applications (Materials Selection Charts).  Detailed background of material properties - information from materials and mechanics.  Numerous case studies highlight the concepts covered.  4 lectures.",
            "title": "Materials Selection in Mechanical Design"
        },
        "MATE 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "MATE 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "MATE 482": {
            "description": "Foundations of senior project design.  Completion of the preliminary stages of selecting a senior project, designing experiments, evaluating realistic constraints, conducting initial experiments, and managing a project timeline.  1 laboratory.",
            "title": "Senior Project I"
        },
        "MATE 483": {
            "description": "Continuation of senior project.  Completion of a senior project experimental component under the guidance of a faculty supervisor.  Research methodology, experimental design, experimental work and data analysis.  2 laboratories.",
            "title": "Senior Project II"
        },
        "MATE 484": {
            "description": "Continuation of MATE 483.  Completion of a senior project data analysis and communication under the guidance of a faculty supervisor.  Mathematical modeling and technical communication.  2 laboratories.",
            "title": "Senior Project III"
        },
        "MATE 495": {
            "description": "Full-time work experience in business, industry, government, and other areas of student career interest.  Positions are paid and usually require relocation and registration in course for two consecutive quarters.  A more fully developed formal report and evaluation by work supervisor required.  Credit/No Credit grading only.  No major credit allowed; total credit limited to 24 units.",
            "title": "Cooperative Education Experience"
        },
        "MATE 500": {
            "description": "Advanced study planned and completed under the direction of a member of department faculty.  Open only to graduate students who have demonstrated ability to do independent work.  Enrollment by petition.  Total credit limited to 12 units.",
            "title": "Individual Study"
        },
        "MATE 510": {
            "description": "Fundamentals of materials characterization methods and thin-film microanalytical techniques, including optical techniques, electron microscopy, X-ray techniques, and ion beam techniques.  Selection of surface analysis techniques.  4 lectures.",
            "title": "Materials Analysis"
        },
        "MATE 522": {
            "description": "Development, utilization, and control of properties in ceramic materials (inorganic-nonmetallic solids).  Emphasis on application on processing to achieve structure and properties.  Structure of crystalline ceramics and of glasses.  Mechanical, thermal, optical, magnetic, and electrical properties.  Application of ceramics in technology.  Physical chemistry of ceramics.  4 lectures.",
            "title": "Advanced Ceramics"
        },
        "MATE 530": {
            "description": "Structure-function relationships for materials in contact with biological systems.  Interactions of materials implanted in the body.  Histological and hematological considerations including foreign body responses, inflammation, carcinogenicity, thrombosis, hemolysis, immunogenic and toxic properties.  Microbial interaction with material surfaces, degradation.  4 lectures.  Crosslisted as BMED/MATE 530.",
            "title": "Biomaterials"
        },
        "MATE 550": {
            "description": "Fundamentals of intelligent systems employing sensors, actuators and intelligent controls.  Impact on material properties as devices shrink in the micrometer realm.  Applications toward exploring nanotechnology.  4 lectures.",
            "title": "Micro Systems"
        },
        "MATE 570": {
            "description": "Directed group study of selected topics for graduate students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1-4 lectures.",
            "title": "Selected Advanced Topics"
        },
        "MATE 571": {
            "description": "Directed group laboratory study of selected topics for advanced students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1-4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "MATE 590": {
            "description": "Thermodynamics, kinetics and morphologies of solid-liquid interfaces.  Heat flow in castings, crystal growth.  Solidification mechanics, solute redistribution.  Production, characterization and testing of metal powders.  Compacting of powder.  Sintering with/without liquid phase.  Hot pressing, properties of sinterings as a function of processing conditions.  Application of theory to the production of useful materials.  4 lectures.",
            "title": "Solidification and Densification"
        },
        "MATE 599": {
            "description": "Each individual or group will be assigned a project for solution under faculty supervision as a requirement for the master's degree, culminating in a written report/thesis.",
            "title": "Design Project (Thesis)"
        }
    },
    "links": [
        {
            "source": "MATE 110",
            "target": "MATE 120",
            "value": 1
        },
        {
            "source": "MATE 120",
            "target": "MATE 130",
            "value": 1
        },
        {
            "source": "CHEM 111",
            "target": "MATE 210",
            "value": 1
        },
        {
            "source": "CHEM 124",
            "target": "MATE 210",
            "value": 1
        },
        {
            "source": "CHEM 127",
            "target": "MATE 210",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 222",
            "value": 1
        },
        {
            "source": "MATE 215",
            "target": "MATE 225",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 232",
            "value": 1
        },
        {
            "source": "MATE 225",
            "target": "MATE 235",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 310",
            "value": 1
        },
        {
            "source": "MATE 340",
            "target": "MATE 310",
            "value": 1
        },
        {
            "source": "STAT 312",
            "target": "MATE 310",
            "value": 1
        },
        {
            "source": "PHYS 132",
            "target": "MATE 325",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "MATE 325",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "MATE 326",
            "value": 1
        },
        {
            "source": "ME 211",
            "target": "MATE 326",
            "value": 1
        },
        {
            "source": "CHEM 124",
            "target": "MATE 327",
            "value": 1
        },
        {
            "source": "PHYS 133",
            "target": "MATE 327",
            "value": 1
        },
        {
            "source": "MATE 350",
            "target": "MATE 330",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 340",
            "value": 1
        },
        {
            "source": "PHYS 133",
            "target": "MATE 340",
            "value": 1
        },
        {
            "source": "MATE 360",
            "target": "MATE 350",
            "value": 1
        },
        {
            "source": "MATE 232",
            "target": "MATE 360",
            "value": 1
        },
        {
            "source": "MATE 235",
            "target": "MATE 360",
            "value": 1
        },
        {
            "source": "MATE 360",
            "target": "MATE 370",
            "value": 1
        },
        {
            "source": "MATE 380",
            "target": "MATE 370",
            "value": 1
        },
        {
            "source": "CHEM 125",
            "target": "MATE 380",
            "value": 1
        },
        {
            "source": "PHYS 133",
            "target": "MATE 380",
            "value": 1
        },
        {
            "source": "MATH 143",
            "target": "MATE 380",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 380",
            "value": 1
        },
        {
            "source": "MATE 215",
            "target": "MATE 380",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 401",
            "value": 1
        },
        {
            "source": "MATE 215",
            "target": "MATE 401",
            "value": 1
        },
        {
            "source": "CHEM 125",
            "target": "MATE 410",
            "value": 1
        },
        {
            "source": "PHYS 133",
            "target": "MATE 410",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 410",
            "value": 1
        },
        {
            "source": "MATE 310",
            "target": "MATE 420",
            "value": 1
        },
        {
            "source": "CHEM 444",
            "target": "MATE 420",
            "value": 1
        },
        {
            "source": "CHEM 125",
            "target": "MATE 425",
            "value": 1
        },
        {
            "source": "CHEM 128",
            "target": "MATE 425",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 425",
            "value": 1
        },
        {
            "source": "MATE 215",
            "target": "MATE 425",
            "value": 1
        },
        {
            "source": "BMED 212",
            "target": "MATE 430",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 430",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 440",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 445",
            "value": 1
        },
        {
            "source": "CHEM 125",
            "target": "MATE 446",
            "value": 1
        },
        {
            "source": "CHEM 128",
            "target": "MATE 446",
            "value": 1
        },
        {
            "source": "CHEM 351",
            "target": "MATE 446",
            "value": 1
        },
        {
            "source": "MATE 380",
            "target": "MATE 446",
            "value": 1
        },
        {
            "source": "ME 302",
            "target": "MATE 446",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 450",
            "value": 1
        },
        {
            "source": "MATE 215",
            "target": "MATE 450",
            "value": 1
        },
        {
            "source": "MATE 350",
            "target": "MATE 450",
            "value": 1
        },
        {
            "source": "EE 112",
            "target": "MATE 458",
            "value": 1
        },
        {
            "source": "EE 201",
            "target": "MATE 458",
            "value": 1
        },
        {
            "source": "MATE 350",
            "target": "MATE 460",
            "value": 1
        },
        {
            "source": "IME 144",
            "target": "MATE 482",
            "value": 1
        },
        {
            "source": "MATE 482",
            "target": "MATE 483",
            "value": 1
        },
        {
            "source": "MATE 483",
            "target": "MATE 484",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 510",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 522",
            "value": 1
        },
        {
            "source": "BIO 161",
            "target": "MATE 530",
            "value": 1
        },
        {
            "source": "BIO 213",
            "target": "MATE 530",
            "value": 1
        },
        {
            "source": "BRAE 213",
            "target": "MATE 530",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 530",
            "value": 1
        },
        {
            "source": "MATE 210",
            "target": "MATE 590",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "MATE 110"
        },
        {
            "group": 1,
            "id": "MATE 120"
        },
        {
            "group": 1,
            "id": "MATE 130"
        },
        {
            "group": 1,
            "id": "MATE 200"
        },
        {
            "group": 1,
            "id": "MATE 210"
        },
        {
            "group": 1,
            "id": "MATE 215"
        },
        {
            "group": 1,
            "id": "MATE 222"
        },
        {
            "group": 1,
            "id": "MATE 225"
        },
        {
            "group": 1,
            "id": "MATE 232"
        },
        {
            "group": 1,
            "id": "MATE 235"
        },
        {
            "group": 1,
            "id": "MATE 270"
        },
        {
            "group": 1,
            "id": "MATE 310"
        },
        {
            "group": 1,
            "id": "MATE 325"
        },
        {
            "group": 1,
            "id": "MATE 326"
        },
        {
            "group": 1,
            "id": "MATE 327"
        },
        {
            "group": 1,
            "id": "MATE 330"
        },
        {
            "group": 1,
            "id": "MATE 340"
        },
        {
            "group": 1,
            "id": "MATE 350"
        },
        {
            "group": 1,
            "id": "MATE 359"
        },
        {
            "group": 1,
            "id": "MATE 360"
        },
        {
            "group": 1,
            "id": "MATE 370"
        },
        {
            "group": 1,
            "id": "MATE 380"
        },
        {
            "group": 1,
            "id": "MATE 400"
        },
        {
            "group": 1,
            "id": "MATE 401"
        },
        {
            "group": 1,
            "id": "MATE 410"
        },
        {
            "group": 1,
            "id": "MATE 420"
        },
        {
            "group": 1,
            "id": "MATE 425"
        },
        {
            "group": 1,
            "id": "MATE 430"
        },
        {
            "group": 1,
            "id": "MATE 435"
        },
        {
            "group": 1,
            "id": "MATE 440"
        },
        {
            "group": 1,
            "id": "MATE 445"
        },
        {
            "group": 1,
            "id": "MATE 446"
        },
        {
            "group": 1,
            "id": "MATE 450"
        },
        {
            "group": 1,
            "id": "MATE 458"
        },
        {
            "group": 1,
            "id": "MATE 460"
        },
        {
            "group": 1,
            "id": "MATE 470"
        },
        {
            "group": 1,
            "id": "MATE 471"
        },
        {
            "group": 1,
            "id": "MATE 482"
        },
        {
            "group": 1,
            "id": "MATE 483"
        },
        {
            "group": 1,
            "id": "MATE 484"
        },
        {
            "group": 1,
            "id": "MATE 495"
        },
        {
            "group": 1,
            "id": "MATE 500"
        },
        {
            "group": 1,
            "id": "MATE 510"
        },
        {
            "group": 1,
            "id": "MATE 522"
        },
        {
            "group": 1,
            "id": "MATE 530"
        },
        {
            "group": 1,
            "id": "MATE 550"
        },
        {
            "group": 1,
            "id": "MATE 570"
        },
        {
            "group": 1,
            "id": "MATE 571"
        },
        {
            "group": 1,
            "id": "MATE 590"
        },
        {
            "group": 1,
            "id": "MATE 599"
        },
        {
            "group": 2,
            "id": "CHEM 111"
        },
        {
            "group": 2,
            "id": "CHEM 124"
        },
        {
            "group": 2,
            "id": "CHEM 127"
        },
        {
            "group": 3,
            "id": "STAT 312"
        },
        {
            "group": 4,
            "id": "PHYS 132"
        },
        {
            "group": 5,
            "id": "MATH 141"
        },
        {
            "group": 6,
            "id": "ME 211"
        },
        {
            "group": 4,
            "id": "PHYS 133"
        },
        {
            "group": 2,
            "id": "CHEM 125"
        },
        {
            "group": 5,
            "id": "MATH 143"
        },
        {
            "group": 2,
            "id": "CHEM 444"
        },
        {
            "group": 2,
            "id": "CHEM 128"
        },
        {
            "group": 7,
            "id": "BMED 212"
        },
        {
            "group": 2,
            "id": "CHEM 351"
        },
        {
            "group": 6,
            "id": "ME 302"
        },
        {
            "group": 8,
            "id": "EE 112"
        },
        {
            "group": 8,
            "id": "EE 201"
        },
        {
            "group": 9,
            "id": "IME 144"
        },
        {
            "group": 10,
            "id": "BIO 161"
        },
        {
            "group": 10,
            "id": "BIO 213"
        },
        {
            "group": 11,
            "id": "BRAE 213"
        }
    ]
}