{
    "descriptions": {
        "SPAN 101": {
            "description": "Beginning Spanish. Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation. Language taught in its intercultural context. Credit not available for students who have completed SPAN 104 or SPAN 111. 3 lectures, 1 activity.",
            "title": "Elementary Spanish I"
        },
        "SPAN 102": {
            "description": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context.  Not open to students with credit in SPAN 104.  To be taken in numerical sequence.  3 lectures, 1 activity.",
            "title": "Elementary Spanish II"
        },
        "SPAN 103": {
            "description": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation.  Language taught in its intercultural context.  Not open to students with credit in SPAN 104.  To be taken in numerical sequence.  3 lectures, 1 activity.",
            "title": "Elementary Spanish III"
        },
        "SPAN 104": {
            "description": "Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation. Language taught in its intercultural context. Offered in summer only. Not open to students who have credit in SPAN 102 and/or SPAN 103. 9 lectures, 3 activities.",
            "title": "Intensive Elementary Spanish"
        },
        "SPAN 111": {
            "description": "Beginning Spanish. Class practice and assigned outside work in pronunciation, sentence structure, reading, writing, and conversation with special focus on vocabulary and culture from American agribusiness and the Hispanic cultures of the United States and Latin America. Not open to students who have credit in SPAN 101. 3 lectures, 1 activity. Fulfills USCP.",
            "title": "Elementary Hispanic Language and Culture"
        },
        "SPAN 201": {
            "description": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Spanish within an intercultural context.  To be taken in numerical sequence.  Not open to students with credit in SPAN 204.  3 lectures, 1 activity.  Fulfills GE C5.",
            "title": "Intermediate Spanish I"
        },
        "SPAN 202": {
            "description": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Spanish within an intercultural context.  To be taken in numerical sequence.  Not open to students with credit in SPAN 204.  3 lectures, 1 activity.  Fulfills GE C5.",
            "title": "Intermediate Spanish II"
        },
        "SPAN 203": {
            "description": "Development of presentational, interpersonal, and interpretive intermediate-level language skills in Spanish within an intercultural context.  To be taken in numerical sequence.  Not open to students with credit in SPAN 206.  3 lectures, 1 activity.  Fulfills GE C5.",
            "title": "Intermediate Spanish III"
        },
        "SPAN 206": {
            "description": "Focus on the grammatical, cultural and linguistic needs of students who grew up speaking Spanish in their homes/communities, but whose schooling has been primarily in English.  Emphasis on reading and writing skills, vocabulary and spelling as well as on cultural understanding.  Not open to students with credit in SPAN 203.  3 lectures, 1 activity.  Fulfills USCP.",
            "title": "Spanish for Heritage Speakers"
        },
        "SPAN 207": {
            "description": "Introduction to the scientific study of the Spanish language with an overview of theoretical and applied linguistics and special emphasis on Spanish phonetics and phonology.  Conducted in Spanish.  3 lectures, 1 activity.",
            "title": "Introduction to Spanish Linguistics"
        },
        "SPAN 233": {
            "description": "Selected readings from Hispanic authors that show the Hispanic literary tradition from the Middle Ages to the present in Spain, Latin America, and of Latino/a writers in the United States.  May include film and other media.  Conducted in Spanish.  4 lectures.  Fulfills GE C1.",
            "title": "Introduction to Hispanic Readings"
        },
        "SPAN 270": {
            "description": "Directed group study of selected topics.  Open only to undergraduate students.  The Schedule of Classes will list topic selected.  Conducted in Spanish.  Total credit limited to 8 units.  1 to 4 lectures.",
            "title": "Selected Topics"
        },
        "SPAN 301": {
            "description": "Oral and written development of structural grammar, syntax, and complex components of Spanish.  Vocabulary expansion and idiomatic construction.  Written compositions.  May include Spanish/English translation.  Conducted in Spanish.  4 lectures.",
            "title": "Advanced Composition in Spanish"
        },
        "SPAN 302": {
            "description": "Formal discussion of, and writing on selected cultural topics from the Spanish-speaking world.  Focus on individual and group presentations and in-class writing and speaking assignments to enhance students' vocabulary and critical thinking skills in Spanish.  Conducted in Spanish.  3 lectures, 1 activity.",
            "title": "Advanced Conversation and Composition in Spanish"
        },
        "SPAN 303": {
            "description": "Developing basic knowledge, skills, theories and techniques required for translation both from Spanish to English and from English to Spanish.  Translating news articles, legal documents, commercial advertisements, formal letters, and literary works.  Conducted in Spanish.  4 lectures.",
            "title": "Introduction to English-Spanish Translation"
        },
        "SPAN 305": {
            "description": "Critical analysis and oral discussion of poetry, essays, novels, plays, films, and other media by selected Hispanic authors.  Conducted in Spanish.  The Schedule of Classes will list topic selected.  Total credit limited to 12 units.  4 lectures.  Fulfills GE C4 except for Modern Languages and Literatures majors.",
            "title": "Significant Works in Spanish"
        },
        "SPAN 307": {
            "description": "Study, analysis, and critique of films from Spain and/or Latin America, organized around such topics as individual film directors or genres, national and international film traditions, migration, gender, ethnicity, and politics.  Evaluation of works in their cultural contexts.  The Schedule of Classes will list topic selected and language of instruction (English or Spanish).  Total credit limited to 8 units.  Course may be offered in classroom-based or online format.  3 lectures, 1 activity.  Fulfills GE C4 except for Modern Languages and Literatures majors.",
            "title": "Spanish and Latin American Film"
        },
        "SPAN 340": {
            "description": "Introduction to Chicano/a literary accomplishments to facilitate appreciation of Chicano/a literary aesthetics and increase understanding of Chicano/a cultural values and lifestyles.  Conducted in Spanish.  4 lectures.  Fulfills GE C4 except for Modern Languages and Literatures majors.  Fulfills USCP.",
            "title": "Chicano/a Authors"
        },
        "SPAN 350": {
            "description": "Selected works to be read by students in English translation.  Critical analysis, interpretation, and comparison of works by Hispanic authors.  Course may include film and other media.  Discussion in English.  The Schedule of Classes will list topic selected.  Total credit limited to 8 units.  4 lectures.  Fulfills GE C4 except for Modern Languages and Literatures majors.",
            "title": "Hispanic Literature in English Translation"
        },
        "SPAN 351": {
            "description": "Analysis and exploration of the major themes of Chicano/Latino literature in the United States today.  Emphasis on Chicano/a, Puerto Rican, Cuban American and other U.S.  Latino/a writers.  All readings and discussions in English.  4 lectures.  Fulfills GE C4 except for Modern Languages and Literatures majors.  Fulfills USCP.",
            "title": "Chicano/Latino Writers in the United States"
        },
        "SPAN 390": {
            "description": "Directed practice with writing narrative, poetry and/or drama writing in Spanish.  An examination of plot, character and theme development.  Crafting of creative literature for potential publication.  Conducted in Spanish.  4 lectures.",
            "title": "Introduction to Creative Writing in Spanish"
        },
        "SPAN 402": {
            "description": "Advanced study of Spanish linguistics.  Topics include bilingualism and code-switching, sounds and pronunciation, word formation, grammatical structures, meaning and intention.  Introduction to research methodologies in the social sciences to discuss issues of Spanish in the US, identity, race, and migration.  Conducted in Spanish.  The Schedule of Classes will list topic selected.  Total credit limited to 8 units.  4 lectures.",
            "title": "Advanced Topics in Spanish Linguistics"
        },
        "SPAN 410": {
            "description": "In-depth study of literature in Spanish.  Specific genre, literary period, authorial group, region, or country.  Chicano/Latino literature, Latin American literature, and Spanish literature.  Course may include film and other media.  Conducted in Spanish.  The Schedule of Classes will list topic selected.  Total credit limited to 8 units.  4 lectures.",
            "title": "Advanced Literature in Spanish"
        },
        "SPAN 416": {
            "description": "Intensive reading of Cervantes' novel, Don Quixote (Part 1, 1605 and Part 2, 1615) in the context of Cervantes' life and the history and social context of Spanish renaissance and baroque culture.  Conducted in Spanish.  4 lectures.",
            "title": "Don Quixote"
        },
        "SPAN 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  Conducted in Spanish.  The Schedule of Classes will list topic selected.  Total credit limited to 8 units.  4 lectures.",
            "title": "Selected Advanced Topics"
        }
    },
    "links": [
        {
            "source": "SPAN 101",
            "target": "SPAN 102",
            "value": 1
        },
        {
            "source": "SPAN 111",
            "target": "SPAN 102",
            "value": 1
        },
        {
            "source": "SPAN 102",
            "target": "SPAN 103",
            "value": 1
        },
        {
            "source": "SPAN 103",
            "target": "SPAN 201",
            "value": 1
        },
        {
            "source": "SPAN 201",
            "target": "SPAN 202",
            "value": 1
        },
        {
            "source": "SPAN 202",
            "target": "SPAN 203",
            "value": 1
        },
        {
            "source": "SPAN 202",
            "target": "SPAN 206",
            "value": 1
        },
        {
            "source": "SPAN 203",
            "target": "SPAN 207",
            "value": 1
        },
        {
            "source": "SPAN 206",
            "target": "SPAN 207",
            "value": 1
        },
        {
            "source": "SPAN 203",
            "target": "SPAN 233",
            "value": 1
        },
        {
            "source": "SPAN 206",
            "target": "SPAN 233",
            "value": 1
        },
        {
            "source": "SPAN 203",
            "target": "SPAN 301",
            "value": 1
        },
        {
            "source": "SPAN 206",
            "target": "SPAN 301",
            "value": 1
        },
        {
            "source": "SPAN 203",
            "target": "SPAN 302",
            "value": 1
        },
        {
            "source": "SPAN 206",
            "target": "SPAN 302",
            "value": 1
        },
        {
            "source": "SPAN 207",
            "target": "SPAN 303",
            "value": 1
        },
        {
            "source": "SPAN 233",
            "target": "SPAN 303",
            "value": 1
        },
        {
            "source": "SPAN 301",
            "target": "SPAN 303",
            "value": 1
        },
        {
            "source": "SPAN 302",
            "target": "SPAN 303",
            "value": 1
        },
        {
            "source": "SPAN 233",
            "target": "SPAN 305",
            "value": 1
        },
        {
            "source": "SPAN 233",
            "target": "SPAN 307",
            "value": 1
        },
        {
            "source": "SPAN 233",
            "target": "SPAN 340",
            "value": 1
        },
        {
            "source": "SPAN 301",
            "target": "SPAN 390",
            "value": 1
        },
        {
            "source": "SPAN 207",
            "target": "SPAN 402",
            "value": 1
        },
        {
            "source": "SPAN 233",
            "target": "SPAN 410",
            "value": 1
        },
        {
            "source": "SPAN 233",
            "target": "SPAN 416",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "SPAN 101"
        },
        {
            "group": 1,
            "id": "SPAN 102"
        },
        {
            "group": 1,
            "id": "SPAN 103"
        },
        {
            "group": 1,
            "id": "SPAN 104"
        },
        {
            "group": 1,
            "id": "SPAN 111"
        },
        {
            "group": 1,
            "id": "SPAN 201"
        },
        {
            "group": 1,
            "id": "SPAN 202"
        },
        {
            "group": 1,
            "id": "SPAN 203"
        },
        {
            "group": 1,
            "id": "SPAN 206"
        },
        {
            "group": 1,
            "id": "SPAN 207"
        },
        {
            "group": 1,
            "id": "SPAN 233"
        },
        {
            "group": 1,
            "id": "SPAN 270"
        },
        {
            "group": 1,
            "id": "SPAN 301"
        },
        {
            "group": 1,
            "id": "SPAN 302"
        },
        {
            "group": 1,
            "id": "SPAN 303"
        },
        {
            "group": 1,
            "id": "SPAN 305"
        },
        {
            "group": 1,
            "id": "SPAN 307"
        },
        {
            "group": 1,
            "id": "SPAN 340"
        },
        {
            "group": 1,
            "id": "SPAN 350"
        },
        {
            "group": 1,
            "id": "SPAN 351"
        },
        {
            "group": 1,
            "id": "SPAN 390"
        },
        {
            "group": 1,
            "id": "SPAN 402"
        },
        {
            "group": 1,
            "id": "SPAN 410"
        },
        {
            "group": 1,
            "id": "SPAN 416"
        },
        {
            "group": 1,
            "id": "SPAN 470"
        }
    ]
}