{
    "descriptions": {
        "SS 121": {
            "description": "Biological, chemical, physical and genetic properties of soils.  Application of scientific principles to solving land use, water management, and soil conservation problems.  Interpretation of soils data for making environmental decisions, applying management practices, and sustainable food production.  3 lectures, 1 laboratory.  Fulfills GE Area B5.",
            "title": "Introductory Soil Science"
        },
        "SS 131": {
            "description": "Soils' ecological functions; soil and the water cycle; soil in production of food, fiber, and forest materials; techniques and reports of soil analyses with agricultural and environmental applications; soil quality; introductory overview of soils and civilizations. Not open to students with credit in SS 121. 3 lectures, 1 activity.",
            "title": "Soils in Environmental and Agricultural Systems"
        },
        "SS 200": {
            "description": "Individual investigation, research, studies, or surveys of selected problems.  Total credit limited to 12 units, with a maximum of 2 units per quarter.  Crosslisted as ERSC/SS 200.",
            "title": "Special Problems for Undergraduates"
        },
        "SS 221": {
            "description": "Plant nutrient requirements in the context of soil health.  Composition, value, and use of fertilizer materials, conditioners and agricultural minerals for sustainable crop production and environmental quality.  3 lectures, 1 laboratory.",
            "title": "Soil Health and Plant Nutrition"
        },
        "SS 270": {
            "description": "Directed group study of selected topics.  The Schedule of Classes will list title selected.  Total credit limited to 12 units.  1 to 4 lectures.  Crosslisted as ERSC/SS 270.",
            "title": "Selected Topics"
        },
        "SS 301": {
            "description": "Supervised practice in technical, educational, professional, and operational applications related to earth sciences or soil science.  Students participate in faculty-supervised group or individual activities that support educational and professional goals.  Credit/No Credit grading only.  Total credit limited to 12 units.  1-2 activities.  Crosslisted as ERSC/SS 301.",
            "title": "Earth Sciences/Soils Science Practicum"
        },
        "SS 321": {
            "description": "Identification of soil morphological and site properties.  Correlation of soil physical and chemical properties with soil taxonomy and land use.  Techniques of interpretations for agriculture, forest lands, wetlands, range lands and urban development.  3 lectures, 1 laboratory.",
            "title": "Soil Morphology"
        },
        "SS 322": {
            "description": "Investigation and evaluation of the nutrient supplying ability of soils.  Conditions and transformations involved in the transfer of mineral nutrients from soils to plants.  Effects of cultural treatments on soil fertility.  Diagnostic techniques and data interpretation in soil and plant analysis.  3 lectures, 1 laboratory.",
            "title": "Soil Plant Relationships"
        },
        "SS 339": {
            "description": "Selected students will spend up to 12 weeks with an approved firm or agency engaged in work and study related to their major.  A detailed written proposal and written interim and final reports required.  One unit of credit may be allowed for each full week of internship.  Credit/No Credit grading.  Crosslisted as ERSC/SS 339.",
            "title": "Internship in Environmental Earth and Soil Sciences"
        },
        "SS 400": {
            "description": "Individual investigation, research, studies or surveys of selected problems.  Total credit limited to 12 units.  Crosslisted as ERSC/SS 400.",
            "title": "Special Problems for Advanced Undergraduates"
        },
        "SS 402": {
            "description": "Experience in soil, compost, and water testing.  Sampling rationale and protocol.  Analyses of compost feedstocks and finished compost; monitoring for consistency.  Theory and practice in use of analytical instrumentation.  Interpretation of results for soil, compost, and water management.  Total credit limited to 6 units for SS or ERSC majors.  Total credit limited to 3 units for Soil Science minor.",
            "title": "Soil, Compost, and Water Testing Enterprise"
        },
        "SS 421": {
            "description": "The formation, characteristics, and functions of wetlands.  Genesis of hydric soils.  Plant adaptations to saturated soils.  Wetlands as wildlife habitat.  Policies and social issues associated with wetlands.  The procedures of wetland delineations.  3 lectures, 1 laboratory.  Crosslisted as BIO/NR/SS 421.",
            "title": "Wetlands"
        },
        "SS 422": {
            "description": "Biochemical activities, ecology and environmental implications of soil organisms.  Effects on the formation, characteristics, and productivity of soils.  Methods of studying soil organisms.  3 lectures, 1 laboratory.",
            "title": "Soil Ecology"
        },
        "SS 423": {
            "description": "Chemical processes governing weathering, soil mineral formation and stability, common solubility equilibria.  Use of chemical principles to explain surface chemical properties of soils and environmental problems in water and soil chemical systems.  Preparation of professional quality reports based on laboratory data and library research.  3 lectures, 1 laboratory, 1 activity.",
            "title": "Environmental Soil and Water Chemistry"
        },
        "SS 431": {
            "description": "Development and production of digital soil surveys for interpretive purposes.  Use of soil taxonomy, land classification systems, geographic information system (GIS) software, and geostatistics to evaluate land for best management practices.  2 lectures, 2 laboratories.",
            "title": "Digital Soil Mapping"
        },
        "SS 432": {
            "description": "Matter and energy in soils, with emphasis on properties and behavior of solids, water, air, and heat.  Applications to agriculture, forestry, range management, engineering, and environmental sciences.  Preparation of professional reports based on laboratory data and library research.  3 lectures, 1 laboratory, 1 activity.",
            "title": "Environmental Soil Physics"
        },
        "SS 440": {
            "description": "Ecosystem approach to chemical, biological, physical and mechanical properties of forest and range soils.  Site quality, nutrient cycling, erosion and mass movement, fire effects.  Preparation of soil management reports similar to those required by various land management organizations.  Overnight field trips.  3 lectures, 1 laboratory.",
            "title": "Forest and Range Soils"
        },
        "SS 442": {
            "description": "Vadose zone and groundwater modeling and monitoring for groundwater basin management.  Principles of saturated and unsaturated flow.  Fate and transport of contaminants in soils and subsurface porous media.  Soil remediation and reclamation of disturbed lands.  3 lectures, 1 laboratory.",
            "title": "Vadose Zone and Groundwater Processes"
        },
        "SS 444": {
            "description": "Morphological description of soils in the field.  Taxonomic determination of classifications and interpretive properties from soil descriptions.  Participation in collegiate soil judging contests.  Total credit limited to 12 units.  1 lecture, 1 laboratory.",
            "title": "Soil Judging"
        },
        "SS 463": {
            "description": "Review of current research, experiments, and problems related to the student's major field of interest.  Preparation and presentation of reports on problems or research activities.  2 seminars.",
            "title": "Undergraduate Seminar"
        },
        "SS 470": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 12 units.  1 to 4 lectures.  Crosslisted as ERSC/SS 470.",
            "title": "Selected Advanced Topics"
        },
        "SS 471": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1 to 4 laboratories.  Crosslisted as ERSC/SS 471.",
            "title": "Selected Advanced Laboratory"
        },
        "SS 500": {
            "description": "Advanced independent study planned and completed under the direction of a member of the Earth and Soil Sciences faculty.  Total credit limited to 6 units.",
            "title": "Individual Study in Soil Science"
        },
        "SS 501": {
            "description": "Problem solving and research planning for agriculture, natural resources and related sciences.  Preparation of study plans that identify problems, review appropriate literature, formulate objectives, develop methods and provide for presentation and interpretation of results.  Oral reports.  4 lectures.",
            "title": "Research Planning"
        },
        "SS 508": {
            "description": "Assessment techniques for the development of soil erosion control and the dispersal of surface runoff water on urban, agriculture, riparian, and rangelands.  Development of a water quality management plan for a specific land use.  3 lectures.",
            "title": "Environmental Assessment for Erosion Control"
        },
        "SS 522": {
            "description": "Current research frontiers in soil fertility.  Evaluating soil testing philosophy, theories and interpretation.  Optimizing soil conditions for maximizing crop production.  Consequences of environmental pollution, trace elements and organic amendments.  Chemical reactions including solubility and chelate equilibria, adsorption phenomena, nutrient mobility, soil mineralogy and weathering.  Use of foliar fertilization.  Radioisotopes in soil fertility.  3 lectures.",
            "title": "Advanced Soil Fertility"
        },
        "SS 570": {
            "description": "Directed group study of selected topics for advanced students.  Open to undergraduate and graduate students.  Class Schedule will list topic selected.  Total credit limited to 12 units.  1 to 4 seminars.",
            "title": "Selected Topics in Soil Science"
        },
        "SS 571": {
            "description": "Directed group laboratory study of selected topics for advanced students.  Open to undergraduate and graduate students.  The Schedule of Classes will list title selected.  Total credit limited to 8 units.  1-4 laboratories.",
            "title": "Selected Advanced Laboratory"
        },
        "SS 581": {
            "description": "Student study and presentation of selected developments, trends and problems in the field of forest and natural resources, earth and soil sciences, and environmental management.  3 seminars.  Crosslisted as NR/SS 581.",
            "title": "Graduate Seminar in Environmental Sciences"
        },
        "SS 582": {
            "description": "Development of plans and practices for the management of crop, range, urban and wood land.  2 seminars, 1 laboratory.",
            "title": "GIS in Advanced Land Management"
        },
        "SS 599": {
            "description": "Individual research in soil science under faculty supervision, leading to a scholarly written presentation exhibiting originality, clarity, critical and independent thinking, proper analysis of data, appropriate organization and format, and accurate and thorough documentation.  Six units required for the M.S.  degree.",
            "title": "Thesis"
        }
    },
    "links": [
        {
            "source": "MATH 96",
            "target": "SS 121",
            "value": 1
        },
        {
            "source": "MATH 104",
            "target": "SS 121",
            "value": 1
        },
        {
            "source": "MATH 115",
            "target": "SS 121",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 221",
            "value": 1
        },
        {
            "source": "SS 110",
            "target": "SS 301",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 301",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 321",
            "value": 1
        },
        {
            "source": "SS 221",
            "target": "SS 322",
            "value": 1
        },
        {
            "source": "CHEM 111",
            "target": "SS 322",
            "value": 1
        },
        {
            "source": "CHEM 128",
            "target": "SS 322",
            "value": 1
        },
        {
            "source": "CHEM 111",
            "target": "SS 402",
            "value": 1
        },
        {
            "source": "CHEM 125",
            "target": "SS 402",
            "value": 1
        },
        {
            "source": "CHEM 128",
            "target": "SS 402",
            "value": 1
        },
        {
            "source": "SS 221",
            "target": "SS 402",
            "value": 1
        },
        {
            "source": "BOT 121",
            "target": "SS 421",
            "value": 1
        },
        {
            "source": "BIO 162",
            "target": "SS 421",
            "value": 1
        },
        {
            "source": "CHEM 111",
            "target": "SS 421",
            "value": 1
        },
        {
            "source": "CHEM 127",
            "target": "SS 421",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 421",
            "value": 1
        },
        {
            "source": "SS 131",
            "target": "SS 421",
            "value": 1
        },
        {
            "source": "CHEM 212",
            "target": "SS 422",
            "value": 1
        },
        {
            "source": "CHEM 312",
            "target": "SS 422",
            "value": 1
        },
        {
            "source": "CHEM 313",
            "target": "SS 422",
            "value": 1
        },
        {
            "source": "SS 221",
            "target": "SS 422",
            "value": 1
        },
        {
            "source": "CHEM 129",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "CHEM 212",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "CHEM 216",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "CHEM 312",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "CHEM 316",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "ERSC 223",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "MATH 118",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "MATH 161",
            "target": "SS 423",
            "value": 1
        },
        {
            "source": "GEOG 318",
            "target": "SS 431",
            "value": 1
        },
        {
            "source": "NR 218",
            "target": "SS 431",
            "value": 1
        },
        {
            "source": "SS 321",
            "target": "SS 431",
            "value": 1
        },
        {
            "source": "STAT 217",
            "target": "SS 431",
            "value": 1
        },
        {
            "source": "STAT 218",
            "target": "SS 431",
            "value": 1
        },
        {
            "source": "CHEM 128",
            "target": "SS 432",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "SS 432",
            "value": 1
        },
        {
            "source": "MATH 161",
            "target": "SS 432",
            "value": 1
        },
        {
            "source": "PHYS 121",
            "target": "SS 432",
            "value": 1
        },
        {
            "source": "PHYS 141",
            "target": "SS 432",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 432",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 440",
            "value": 1
        },
        {
            "source": "SS 321",
            "target": "SS 440",
            "value": 1
        },
        {
            "source": "CHEM 212",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "CHEM 216",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "CHEM 312",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "GEOL 201",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "MATH 161",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "MATH 141",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 442",
            "value": 1
        },
        {
            "source": "SS 321",
            "target": "SS 444",
            "value": 1
        },
        {
            "source": "SS 461",
            "target": "SS 463",
            "value": 1
        },
        {
            "source": "SS 121",
            "target": "SS 508",
            "value": 1
        },
        {
            "source": "SS 322",
            "target": "SS 522",
            "value": 1
        },
        {
            "source": "LA 318",
            "target": "SS 582",
            "value": 1
        }
    ],
    "nodes": [
        {
            "group": 1,
            "id": "SS 121"
        },
        {
            "group": 1,
            "id": "SS 131"
        },
        {
            "group": 1,
            "id": "SS 200"
        },
        {
            "group": 1,
            "id": "SS 221"
        },
        {
            "group": 1,
            "id": "SS 270"
        },
        {
            "group": 1,
            "id": "SS 301"
        },
        {
            "group": 1,
            "id": "SS 321"
        },
        {
            "group": 1,
            "id": "SS 322"
        },
        {
            "group": 1,
            "id": "SS 339"
        },
        {
            "group": 1,
            "id": "SS 400"
        },
        {
            "group": 1,
            "id": "SS 402"
        },
        {
            "group": 1,
            "id": "SS 421"
        },
        {
            "group": 1,
            "id": "SS 422"
        },
        {
            "group": 1,
            "id": "SS 423"
        },
        {
            "group": 1,
            "id": "SS 431"
        },
        {
            "group": 1,
            "id": "SS 432"
        },
        {
            "group": 1,
            "id": "SS 440"
        },
        {
            "group": 1,
            "id": "SS 442"
        },
        {
            "group": 1,
            "id": "SS 444"
        },
        {
            "group": 1,
            "id": "SS 463"
        },
        {
            "group": 1,
            "id": "SS 470"
        },
        {
            "group": 1,
            "id": "SS 471"
        },
        {
            "group": 1,
            "id": "SS 500"
        },
        {
            "group": 1,
            "id": "SS 501"
        },
        {
            "group": 1,
            "id": "SS 508"
        },
        {
            "group": 1,
            "id": "SS 522"
        },
        {
            "group": 1,
            "id": "SS 570"
        },
        {
            "group": 1,
            "id": "SS 571"
        },
        {
            "group": 1,
            "id": "SS 581"
        },
        {
            "group": 1,
            "id": "SS 582"
        },
        {
            "group": 1,
            "id": "SS 599"
        },
        {
            "group": 2,
            "id": "MATH 96"
        },
        {
            "group": 2,
            "id": "MATH 104"
        },
        {
            "group": 2,
            "id": "MATH 115"
        },
        {
            "group": 1,
            "id": "SS 110"
        },
        {
            "group": 3,
            "id": "CHEM 111"
        },
        {
            "group": 3,
            "id": "CHEM 128"
        },
        {
            "group": 3,
            "id": "CHEM 125"
        },
        {
            "group": 4,
            "id": "BOT 121"
        },
        {
            "group": 5,
            "id": "BIO 162"
        },
        {
            "group": 3,
            "id": "CHEM 127"
        },
        {
            "group": 3,
            "id": "CHEM 212"
        },
        {
            "group": 3,
            "id": "CHEM 312"
        },
        {
            "group": 3,
            "id": "CHEM 313"
        },
        {
            "group": 3,
            "id": "CHEM 129"
        },
        {
            "group": 3,
            "id": "CHEM 216"
        },
        {
            "group": 3,
            "id": "CHEM 316"
        },
        {
            "group": 6,
            "id": "ERSC 223"
        },
        {
            "group": 2,
            "id": "MATH 118"
        },
        {
            "group": 2,
            "id": "MATH 141"
        },
        {
            "group": 2,
            "id": "MATH 161"
        },
        {
            "group": 7,
            "id": "GEOG 318"
        },
        {
            "group": 8,
            "id": "NR 218"
        },
        {
            "group": 9,
            "id": "STAT 217"
        },
        {
            "group": 9,
            "id": "STAT 218"
        },
        {
            "group": 10,
            "id": "PHYS 121"
        },
        {
            "group": 10,
            "id": "PHYS 141"
        },
        {
            "group": 11,
            "id": "GEOL 201"
        },
        {
            "group": 1,
            "id": "SS 461"
        },
        {
            "group": 12,
            "id": "LA 318"
        }
    ]
}